
-- phpMyAdmin SQL Dump
-- version 5.2.2
-- https://www.phpmyadmin.net/
--
-- ظ…ط¶ظٹظپ: 127.0.0.1
-- ظˆظ‚طھ ط§ظ„ط¬ظٹظ„: 06 ط£ظƒطھظˆط¨ط± 2025 ط§ظ„ط³ط§ط¹ط© 23:14
-- ط¥طµط¯ط§ط± ط§ظ„ط®ط§ط¯ظ…: 12.0.2-MariaDB
-- ظ†ط³ط®ط© PHP: 8.4.2

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- ظ‚ط§ط¹ط¯ط© ط¨ظٹط§ظ†ط§طھ: `departments_system`
--

-- --------------------------------------------------------

--
-- ط¨ظ†ظٹط© ط§ظ„ط¬ط¯ظˆظ„ `alert_checkpoints`
--

CREATE TABLE `alert_checkpoints` (
  `id` int(11) NOT NULL,
  `alert_id` int(11) NOT NULL,
  `checkpoint_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- ط¨ظ†ظٹط© ط§ظ„ط¬ط¯ظˆظ„ `checkpoints`
--

CREATE TABLE `checkpoints` (
  `id` int(11) NOT NULL,
  `name` varchar(100) NOT NULL,
  `created_at` datetime NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- ط¨ظ†ظٹط© ط§ظ„ط¬ط¯ظˆظ„ `department`
--

CREATE TABLE `department` (
  `id` int(11) NOT NULL,
  `department_name` varchar(100) NOT NULL,
  `address` varchar(70) NOT NULL,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `neighborhoods_id` int(11) NOT NULL,
  `districts_id` int(11) NOT NULL,
  `type` varchar(30) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- ط¥ط±ط¬ط§ط¹ ط£ظˆ ط§ط³طھظٹط±ط§ط¯ ط¨ظٹط§ظ†ط§طھ ط§ظ„ط¬ط¯ظˆظ„ `department`
--

INSERT INTO `department` (`id`, `department_name`, `address`, `created_at`, `neighborhoods_id`, `districts_id`, `type`) VALUES
(1, 'ظ‚ط³ظ… ط¹طµظٹظپط±ط© ', 'JSJSJSJ', '2025-09-02 16:28:23', 1, 1, 'police'),
(2, 'ظ‚ط³ظ… ط§ظ„ط«ظˆط±ط© ', '', '2025-09-02 16:29:04', 4, 1, ''),
(3, 'ظ‚ط³ظ… ط§ظ„طھط­ط±ظٹط±', '', '2025-09-02 16:30:36', 8, 1, ''),
(4, 'ظ‚ط³ظ… ط§ظ„ط¬ط¨ط¬ط¨', '', '2025-09-02 16:34:23', 13, 2, ''),
(5, 'ظ‚ط³ظ… ط§ظ„ط®ط²ظٹظ…ط©', '', '2025-09-02 16:35:23', 14, 2, '');

-- --------------------------------------------------------

--
-- ط¨ظ†ظٹط© ط§ظ„ط¬ط¯ظˆظ„ `department_report_reviews`
--

CREATE TABLE `department_report_reviews` (
  `id` int(11) NOT NULL,
  `report_id` int(11) NOT NULL,
  `department_id` int(11) NOT NULL,
  `reviewer_id` int(11) NOT NULL,
  `reviewed_at` datetime DEFAULT NULL,
  `sent_to_management` tinyint(1) DEFAULT 0,
  `sent_at` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- ط¥ط±ط¬ط§ط¹ ط£ظˆ ط§ط³طھظٹط±ط§ط¯ ط¨ظٹط§ظ†ط§طھ ط§ظ„ط¬ط¯ظˆظ„ `department_report_reviews`
--

INSERT INTO `department_report_reviews` (`id`, `report_id`, `department_id`, `reviewer_id`, `reviewed_at`, `sent_to_management`, `sent_at`) VALUES
(1, 49, 1, 2, '2025-10-07 01:51:03', 1, '2025-10-07 01:51:03'),
(2, 50, 1, 2, '2025-10-07 01:51:03', 1, '2025-10-07 01:51:03'),
(3, 57, 1, 2, '2025-10-07 01:51:03', 1, '2025-10-07 01:51:03'),
(4, 60, 1, 2, '2025-10-07 01:51:03', 1, '2025-10-07 01:51:03'),
(5, 63, 1, 2, '2025-10-07 01:51:03', 1, '2025-10-07 01:51:03'),
(6, 65, 1, 2, '2025-10-07 01:51:03', 1, '2025-10-07 01:51:03'),
(7, 66, 1, 2, '2025-10-07 01:51:03', 1, '2025-10-07 01:51:03'),
(8, 67, 1, 2, '2025-10-07 01:51:03', 1, '2025-10-07 01:51:03'),
(9, 68, 1, 2, '2025-10-07 01:51:03', 1, '2025-10-07 01:51:03'),
(10, 70, 1, 2, '2025-10-07 01:51:03', 1, '2025-10-07 01:51:03'),
(11, 71, 1, 2, NULL, 0, NULL),
(12, 72, 1, 2, NULL, 0, NULL),
(13, 73, 1, 2, NULL, 0, NULL),
(14, 74, 1, 2, NULL, 0, NULL),
(15, 75, 1, 2, NULL, 0, NULL),
(16, 76, 1, 2, NULL, 0, NULL),
(17, 77, 1, 2, NULL, 0, NULL),
(18, 78, 1, 2, NULL, 0, NULL),
(19, 79, 1, 2, NULL, 0, NULL),
(20, 80, 1, 2, NULL, 0, NULL),
(21, 81, 1, 2, NULL, 0, NULL),
(22, 82, 1, 2, NULL, 0, NULL),
(23, 83, 1, 2, NULL, 0, NULL),
(24, 84, 1, 2, NULL, 0, NULL),
(25, 85, 1, 2, NULL, 0, NULL),
(26, 86, 1, 2, NULL, 0, NULL),
(27, 87, 1, 2, NULL, 0, NULL),
(28, 88, 1, 2, NULL, 0, NULL),
(29, 89, 1, 2, NULL, 0, NULL),
(30, 231, 1, 2, NULL, 0, NULL),
(31, 237, 1, 2, NULL, 0, NULL),
(32, 238, 1, 2, NULL, 0, NULL),
(33, 239, 1, 2, NULL, 0, NULL),
(34, 108, 2, 12, '2025-10-07 01:52:05', 1, '2025-10-07 01:52:05'),
(35, 109, 2, 12, '2025-10-07 01:52:05', 1, '2025-10-07 01:52:05'),
(36, 110, 2, 12, '2025-10-07 01:52:05', 1, '2025-10-07 01:52:05'),
(37, 111, 2, 12, '2025-10-07 01:52:05', 1, '2025-10-07 01:52:05'),
(38, 112, 2, 12, '2025-10-07 01:52:05', 1, '2025-10-07 01:52:05'),
(39, 113, 2, 12, '2025-10-07 01:52:05', 1, '2025-10-07 01:52:05'),
(40, 114, 2, 12, '2025-10-07 01:52:05', 1, '2025-10-07 01:52:05'),
(41, 115, 2, 12, '2025-10-07 01:52:05', 1, '2025-10-07 01:52:05'),
(42, 116, 2, 12, '2025-10-07 01:52:05', 1, '2025-10-07 01:52:05'),
(43, 117, 2, 12, '2025-10-07 01:52:05', 1, '2025-10-07 01:52:05'),
(44, 118, 2, 12, '2025-10-07 01:52:05', 1, '2025-10-07 01:52:05'),
(45, 119, 2, 12, '2025-10-07 01:52:05', 1, '2025-10-07 01:52:05'),
(46, 120, 2, 12, '2025-10-07 01:52:05', 1, '2025-10-07 01:52:05'),
(47, 121, 2, 12, '2025-10-07 01:52:05', 1, '2025-10-07 01:52:05'),
(48, 122, 2, 12, '2025-10-07 01:52:05', 1, '2025-10-07 01:52:05'),
(49, 123, 2, 12, NULL, 0, NULL),
(50, 124, 2, 12, NULL, 0, NULL),
(51, 125, 2, 12, NULL, 0, NULL),
(52, 126, 2, 12, NULL, 0, NULL),
(53, 127, 2, 12, NULL, 0, NULL),
(54, 128, 2, 12, NULL, 0, NULL),
(55, 129, 2, 12, NULL, 0, NULL),
(56, 130, 2, 12, NULL, 0, NULL),
(57, 131, 2, 12, NULL, 0, NULL),
(58, 132, 2, 12, NULL, 0, NULL),
(59, 133, 2, 12, NULL, 0, NULL),
(60, 134, 2, 12, NULL, 0, NULL),
(61, 135, 2, 12, NULL, 0, NULL),
(62, 136, 2, 12, NULL, 0, NULL),
(63, 137, 2, 12, NULL, 0, NULL),
(64, 138, 2, 12, NULL, 0, NULL),
(65, 139, 2, 12, NULL, 0, NULL),
(66, 140, 2, 12, NULL, 0, NULL),
(67, 141, 2, 12, NULL, 0, NULL),
(68, 142, 2, 12, NULL, 0, NULL),
(69, 143, 2, 12, NULL, 0, NULL),
(70, 144, 2, 12, NULL, 0, NULL),
(71, 145, 2, 12, NULL, 0, NULL),
(72, 146, 2, 12, NULL, 0, NULL),
(73, 147, 2, 12, NULL, 0, NULL),
(74, 148, 2, 12, NULL, 0, NULL),
(75, 149, 2, 12, NULL, 0, NULL),
(76, 150, 2, 12, NULL, 0, NULL),
(77, 151, 2, 12, NULL, 0, NULL),
(78, 152, 2, 12, NULL, 0, NULL),
(79, 153, 2, 12, NULL, 0, NULL),
(80, 154, 2, 12, NULL, 0, NULL),
(81, 155, 2, 12, NULL, 0, NULL),
(82, 156, 2, 12, NULL, 0, NULL),
(83, 157, 2, 12, NULL, 0, NULL);

-- --------------------------------------------------------

--
-- ط¨ظ†ظٹط© ط§ظ„ط¬ط¯ظˆظ„ `districts`
--

CREATE TABLE `districts` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `governorate_id` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- ط¥ط±ط¬ط§ط¹ ط£ظˆ ط§ط³طھظٹط±ط§ط¯ ط¨ظٹط§ظ†ط§طھ ط§ظ„ط¬ط¯ظˆظ„ `districts`
--

INSERT INTO `districts` (`id`, `name`, `governorate_id`) VALUES
(1, 'ط§ظ„ظ‚ط§ظ‡ط±ط©', 1),
(2, 'ط¬ط¨ظ„ ط­ط¨ط´ظٹ', 1),
(3, 'ط§ظ„ظ…ط³ط±ط§ط®', 1),
(4, 'ظ…ط¯ظٹظ†ط© طھط¹ط²', 1),
(5, 'ط§ظ„ظ…ط³ط±ط§ط®', 1),
(6, 'ط§ظ„ط´ظ…ط§ظٹطھظٹظ†', 1),
(7, 'ط¬ط¨ظ„ط©', 1),
(8, 'ط­ظٹظپط§ظ†', 1),
(9, 'ظ…ظ‚ط¨ظ†ط©', 1),
(10, 'ط§ظ„ظ…ظˆط§ط³ط·', 1),
(11, 'ط§ظ„ظ…ط¹ط§ظپط±', 1),
(12, 'ط³ط§ظ…ط¹', 1),
(13, 'طµط§ظ„ط©', 1),
(14, 'ظ…ط´ط±ط¹ط© ظˆط­ط¯ظ†ط§ظ†', 1),
(15, 'ط§ظ„ط¹ط§ط±ط¶ط©', 1),
(16, 'ظ…ط³ظˆط±ط©', 1);

-- --------------------------------------------------------

--
-- ط¨ظ†ظٹط© ط§ظ„ط¬ط¯ظˆظ„ `employees`
--

CREATE TABLE `employees` (
  `employee_id` int(11) NOT NULL,
  `name_full` varchar(110) NOT NULL,
  `username` varchar(50) NOT NULL,
  `password` varchar(255) NOT NULL,
  `email` varchar(100) NOT NULL,
  `number_phone` varchar(20) NOT NULL,
  `position_type` varchar(60) NOT NULL,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `department_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- ط¥ط±ط¬ط§ط¹ ط£ظˆ ط§ط³طھظٹط±ط§ط¯ ط¨ظٹط§ظ†ط§طھ ط§ظ„ط¬ط¯ظˆظ„ `employees`
--

INSERT INTO `employees` (`employee_id`, `name_full`, `username`, `password`, `email`, `number_phone`, `position_type`, `created_at`, `department_id`) VALUES
(2, 'ehabbbb', 'amaarr', 'ammmsmms', 'amarrr@gmail.com', '77', '??????', '2025-08-20 18:59:04', 1),
(8, 'lkfglf', 'gffgf', 'fgfg', 'fgfgf', 'fgfgfggfg', 'gfgfg', '2025-08-30 18:42:26', 1),
(12, 'ظ…ط­ظ…ط¯ ط³ط¹ظٹط¯ ظ‚ط§ط¦ط¯ ط¹ط¨ط¯ط© ', 'abdullahaldys9003', '8818181819', 'aldysaldys@gmail.com', '777222681', 'admin', '2025-10-03 01:05:47', 2),
(13, 'ظ…ط­ظ…ط¯ ط³ط¹ظٹط¯ ظ‚ط§ط¦ط¯ ط¹ط¨ط¯ط© ', 'abdullahaldys9003', '8818181819', 'aldysaldys@gmail.com', '777222681', 'admin', '2025-10-03 01:14:38', 2),
(14, 'abdullah aldys', 'NajnanNn', '', 'aldysadys@gmail.com', '7777777777', 'admin', '2025-10-03 01:24:28', 2),
(15, 'abdullah aldys', 'NajnanNn', '818282929922', 'aldsadys@gmail.com', '7777777777', 'admin', '2025-10-03 01:26:10', 2),
(16, 'abdullah aldys', 'NajnanNn', '818282929922', 'asadys@gmail.com', '7777777777', 'admin', '2025-10-03 01:26:18', 2),
(17, 'abdullah aldys', 'NajnanNn', '818282929922', 'asays@gmail.com', '7777777777', 'admin', '2025-10-03 01:27:49', 2),
(18, 'abdaldys', 'NajnanNn', '818282929922', 'asys@gmail.com', '777777777', 'admin', '2025-10-03 01:28:58', 2),
(19, 'nananan', 'Jajjaan', '8282828282', 'abdualdys9003@gmail.com', '8282929929', 'user', '2025-10-03 01:30:57', 5),
(20, 'nananan', 'Jajjaan', '8282828282', 'abduadys9003@gmail.com', '8282929929', 'user', '2025-10-03 01:32:02', 5),
(21, 'Jajajsjjsj', 'Jajjajanans', '91929929', 'abdullahaldys9003@gmail.com', '8282929929', 'user', '2025-10-03 01:44:30', 2),
(22, 'abdullah aldys', 'ظ†ط­ظ…ط¯ ط¹ظ„ظٹ ظ‚ط§ط¦ط¯ ط³طھط¨ط¯ ', '', 'Abdullah@gmail.com', '7777277227', 'user', '2025-10-07 01:14:18', 1);

-- --------------------------------------------------------

--
-- ط¨ظ†ظٹط© ط§ظ„ط¬ط¯ظˆظ„ `error_reports`
--

CREATE TABLE `error_reports` (
  `id` int(11) NOT NULL,
  `report_id` int(11) NOT NULL,
  `field_name` varchar(100) NOT NULL,
  `field_label` varchar(100) NOT NULL,
  `current_value` text DEFAULT NULL,
  `suggested_correction` text DEFAULT NULL,
  `error_description` text DEFAULT NULL,
  `status` enum('reported','under_review','approved','rejected','corrected') DEFAULT 'reported',
  `department_id` int(11) DEFAULT NULL,
  `user_by` int(11) DEFAULT NULL,
  `reported_at` datetime DEFAULT current_timestamp(),
  `reviewed_at` datetime DEFAULT NULL,
  `corrected_at` datetime DEFAULT NULL,
  `review_notes` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- ط¥ط±ط¬ط§ط¹ ط£ظˆ ط§ط³طھظٹط±ط§ط¯ ط¨ظٹط§ظ†ط§طھ ط§ظ„ط¬ط¯ظˆظ„ `error_reports`
--

INSERT INTO `error_reports` (`id`, `report_id`, `field_name`, `field_label`, `current_value`, `suggested_correction`, `error_description`, `status`, `department_id`, `user_by`, `reported_at`, `reviewed_at`, `corrected_at`, `review_notes`) VALUES
(1, 49, 'phone', 'ط±ظ‚ظ… ط§ظ„ظ‡ط§طھظپ', 'Nana', 'Nana', 'Nan', 'rejected', 1, 1, '2025-10-02 01:16:35', '2025-10-02 01:32:39', NULL, ''),
(2, 49, 'description', 'ظˆطµظپ ط§ظ„ط¨ظ„ط§ط؛', 'ظ‚ط§ط¦ط¯ ط¹ط¨ط¯ظ‡ ط³ط¹ظٹط¯ ط¹ظ„ظٹ ', 'ظ…ط­ظ…ط¯ ظ‚ط§ط¦ط¯ ط¹ط¨ط¯ط© ', 'ط­طµظˆظ„ ط®ط·ط§ط، ', 'rejected', 1, 1, '2025-10-02 02:03:02', '2025-10-02 16:28:00', NULL, ''),
(3, 49, 'sub_id', 'ظ†ظˆط¹ ط§ظ„ط¨ظ„ط§ط؛ ط§ظ„ظپط±ط¹ظٹ', 'ط¨ظ„ط§ط؛ ط³ط±ظ‚ط© ', 'ط³ط±ظ‚ط© ظ…ظ„ط§ط¨ط³ ', 'ط®ط·ط§ط، ', 'approved', 1, 1, '2025-10-02 17:23:46', '2025-10-02 17:25:32', NULL, ''),
(4, 50, 'gender', 'ط§ظ„ط¬ظ†ط³', 'male', 'طھط¹ط¯ظٹظ„ظ‡طھ ', 'ظ†ظٹظ†ظٹ', 'reported', 1, 2, '2025-10-02 19:10:36', NULL, NULL, NULL),
(5, 50, 'district_suspects', 'ظ…ط¯ظٹط±ظٹط© ط§ظ„ظ…ط¨ظ„ط؛ ط¹ظ†ظ‡', 'ظ„ط§ طھظˆط¬ط¯ ط¨ظٹط§ظ†ط§طھ', '13', 'Nznz', 'reported', 1, 2, '2025-10-02 19:16:46', NULL, NULL, NULL),
(6, 49, 'sub_type_name', 'ظ†ظˆط¹ ط§ظ„ط¨ظ„ط§ط؛ ط§ظ„ظپط±ط¹ظٹ', 'ط³ط±ظ‚ط© ظ…ظ†ط§ط²ظ„', '18', 'ظ‚ظ…طھ ظپظٹ ط§ظ„ظ†ظ‚ط± ط¨ط§ظ„ط®ط·ط§ط، ط¨ط§ظ„ظ†ظ‚ط± ط¹ظ„ظ‰ ط³ط±ظ‚ط© ظ…ظ†ط§ط²ظ„ ', 'reported', 1, 2, '2025-10-02 20:37:29', NULL, NULL, NULL),
(7, 49, 'neighborhood_suspect_name', 'ط­ظٹ ط§ظ„ظ…ط¨ظ„ط؛ ط¹ظ†ظ‡', 'ط§ظ„طھط­ط±ظٹط±', '43', 'ط®ط·ط©ط،', 'reported', 1, 2, '2025-10-02 23:26:09', NULL, NULL, NULL),
(8, 49, 'sub_type_name', 'ظ†ظˆط¹ ط§ظ„ط¨ظ„ط§ط؛ ط§ظ„ظپط±ط¹ظٹ', 'ط³ط±ظ‚ط© ظ…ظ†ط§ط²ظ„', '29', 'ط§ط§', 'reported', 1, 2, '2025-10-03 15:49:23', NULL, NULL, NULL),
(9, 49, 'gender', 'ط§ظ„ط¬ظ†ط³', 'male', 'male', 'ط®ط·ط،', 'reported', 1, 2, '2025-10-05 21:05:17', NULL, NULL, NULL);

-- --------------------------------------------------------

--
-- ط¨ظ†ظٹط© ط§ظ„ط¬ط¯ظˆظ„ `governorates`
--

CREATE TABLE `governorates` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- ط¥ط±ط¬ط§ط¹ ط£ظˆ ط§ط³طھظٹط±ط§ط¯ ط¨ظٹط§ظ†ط§طھ ط§ظ„ط¬ط¯ظˆظ„ `governorates`
--

INSERT INTO `governorates` (`id`, `name`) VALUES
(1, 'طھط¹ط²'),
(2, 'طµظ†ط¹ط§ط، '),
(3, 'ط§ط¨ ');

-- --------------------------------------------------------

--
-- ط¨ظ†ظٹط© ط§ظ„ط¬ط¯ظˆظ„ `logs_activity`
--

CREATE TABLE `logs_activity` (
  `id_activity` int(11) NOT NULL,
  `id_user` int(11) NOT NULL,
  `table_target` varchar(50) NOT NULL,
  `createdAt` datetime NOT NULL DEFAULT current_timestamp(),
  `id_record` int(11) NOT NULL,
  `action` enum('create','update','delete','login','logout','status_change') NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- ط¥ط±ط¬ط§ط¹ ط£ظˆ ط§ط³طھظٹط±ط§ط¯ ط¨ظٹط§ظ†ط§طھ ط§ظ„ط¬ط¯ظˆظ„ `logs_activity`
--

INSERT INTO `logs_activity` (`id_activity`, `id_user`, `table_target`, `createdAt`, `id_record`, `action`) VALUES
(1, 2, 'ط§ظ„ط¨ظ„ط§ط؛ط§طھ ', '2025-08-21 18:47:52', 2, 'create'),
(2, 2, 'ط§ظ„ظ…ط³طھط®ط¯ظ…ظٹظ† ', '2025-08-21 18:49:09', 2, 'create'),
(3, 2, 'ط§ظ„ط¨ظ„ط§ط؛ط§طھ ', '2025-08-21 18:49:09', 13, 'create'),
(5, 2, 'reports', '2025-09-03 19:13:54', 49, 'create'),
(6, 2, 'reports', '2025-09-03 19:14:00', 50, 'create'),
(7, 2, 'reports', '2025-09-13 20:58:47', 57, 'create'),
(8, 2, 'reports', '2025-09-13 20:58:57', 58, 'create'),
(9, 2, 'reports', '2025-09-13 20:59:39', 59, 'create'),
(10, 2, 'reports', '2025-09-13 21:39:28', 60, 'create'),
(11, 2, 'reports', '2025-09-14 07:47:25', 61, 'create'),
(12, 2, 'reports', '2025-09-20 23:33:48', 62, 'create'),
(13, 2, 'reports', '2025-09-29 23:26:42', 63, 'create'),
(14, 2, 'reports', '2025-10-01 21:08:27', 65, 'create'),
(15, 2, 'reports', '2025-10-03 15:41:57', 66, 'create'),
(16, 2, 'reports', '2025-10-03 18:19:28', 67, 'create'),
(17, 2, 'reports', '2025-10-03 23:57:02', 68, 'create'),
(18, 2, 'reports', '2025-10-05 20:14:46', 231, 'create'),
(19, 2, 'reports', '2025-10-05 20:54:41', 237, 'create'),
(20, 2, 'reports', '2025-10-05 20:57:39', 238, 'create'),
(21, 2, 'reports', '2025-10-05 20:58:52', 239, 'create'),
(22, 2, 'reports', '2025-10-06 21:33:02', 240, 'create'),
(23, 2, 'reports', '2025-10-06 21:33:25', 241, 'create'),
(24, 2, 'reports', '2025-10-06 21:34:28', 242, 'create'),
(25, 2, 'reports', '2025-10-06 21:35:37', 243, 'create'),
(26, 2, 'reports', '2025-10-06 21:36:51', 244, 'create'),
(27, 2, 'reports', '2025-10-06 21:38:52', 245, 'create'),
(28, 2, 'reports', '2025-10-06 21:38:58', 246, 'create'),
(29, 2, 'reports', '2025-10-06 21:39:08', 247, 'create'),
(30, 2, 'reports', '2025-10-06 21:39:13', 248, 'create'),
(31, 2, 'reports', '2025-10-06 21:39:18', 249, 'create'),
(32, 2, 'reports', '2025-10-06 21:39:31', 250, 'create'),
(33, 2, 'reports', '2025-10-06 21:39:35', 251, 'create'),
(34, 2, 'reports', '2025-10-06 21:40:19', 252, 'create'),
(35, 2, 'reports', '2025-10-06 21:40:34', 253, 'create'),
(36, 2, 'reports', '2025-10-06 21:41:22', 254, 'create'),
(37, 2, 'reports', '2025-10-06 21:41:43', 255, 'create'),
(38, 2, 'reports', '2025-10-06 21:42:12', 256, 'create'),
(39, 2, 'reports', '2025-10-06 21:43:20', 257, 'create'),
(40, 2, 'reports', '2025-10-06 21:43:26', 258, 'create'),
(41, 2, 'reports', '2025-10-06 21:46:08', 259, 'create'),
(42, 2, 'reports', '2025-10-06 21:46:17', 260, 'create'),
(43, 2, 'reports', '2025-10-06 21:47:40', 261, 'create'),
(44, 2, 'reports', '2025-10-06 22:03:40', 262, 'create'),
(45, 2, 'reports', '2025-10-06 22:04:03', 263, 'create'),
(46, 2, 'reports', '2025-10-06 22:04:21', 264, 'create'),
(47, 2, 'reports', '2025-10-06 22:08:39', 265, 'create'),
(48, 2, 'reports', '2025-10-06 22:08:44', 266, 'create'),
(49, 2, 'reports', '2025-10-06 22:22:59', 267, 'create'),
(50, 2, 'reports', '2025-10-06 22:27:23', 268, 'create'),
(51, 2, 'reports', '2025-10-06 22:31:48', 269, 'create'),
(52, 2, 'reports', '2025-10-06 22:35:13', 270, 'create'),
(53, 2, 'reports', '2025-10-06 22:35:31', 271, 'create'),
(54, 2, 'reports', '2025-10-06 22:37:44', 272, 'create'),
(55, 2, 'reports', '2025-10-06 22:37:52', 273, 'create'),
(56, 2, 'reports', '2025-10-06 22:43:27', 274, 'create'),
(57, 2, 'reports', '2025-10-06 22:43:33', 275, 'create'),
(58, 2, 'reports', '2025-10-06 22:50:17', 276, 'create'),
(59, 2, 'reports', '2025-10-07 00:30:17', 277, 'create');

-- --------------------------------------------------------

--
-- ط¨ظ†ظٹط© ط§ظ„ط¬ط¯ظˆظ„ `neighborhoods`
--

CREATE TABLE `neighborhoods` (
  `id` int(11) NOT NULL,
  `name` varchar(15) NOT NULL,
  `district_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- ط¥ط±ط¬ط§ط¹ ط£ظˆ ط§ط³طھظٹط±ط§ط¯ ط¨ظٹط§ظ†ط§طھ ط§ظ„ط¬ط¯ظˆظ„ `neighborhoods`
--

INSERT INTO `neighborhoods` (`id`, `name`, `district_id`) VALUES
(1, 'ط¹طµظٹظپط±ط©', 1),
(2, 'ط§ظ„ظ‚ط§ظ‡ط±ط©', 1),
(3, 'ط§ظ„ظ…ظٹط¯ط§ظ†', 1),
(4, 'ط§ظ„ط«ظˆط±ط©', 1),
(5, 'ط§ظ„ط³ظ„ط§ظ…', 1),
(6, 'ط§ظ„ط­ط±ظٹط©', 1),
(7, 'ط§ظ„ظˆط­ط¯ط©', 1),
(8, 'ط§ظ„طھط­ط±ظٹط±', 1),
(9, 'ط§ظ„ط´ظ‡ط¯ط§ط،', 1),
(10, 'ط§ظ„ط²ظ‡ط±ط§ط،', 1),
(11, 'ط§ظ„ط§طµط¨ط­ظٹ', 1),
(12, 'ط§ظ„ظ…ط±ظƒط²', 2),
(13, 'ط§ظ„ط¬ط¨ط¬ط¨', 2),
(14, 'ط§ظ„ط®ط²ظٹظ…ط©', 2),
(15, 'ط§ظ„ط³ظ‡ظ„ظٹط©', 2),
(16, 'ط§ظ„ط¹ط§ط±ط¶ط©', 2),
(17, 'ط§ظ„ظ…ط±ظƒط²', 3),
(18, 'ط§ظ„ط¹ط±ط´', 3),
(19, 'ط§ظ„ط®ط¶ط±ط§ط،', 3),
(20, 'ط§ظ„ظ…ظ†طµظˆط±ط©', 3),
(21, 'ط§ظ„ظپط¶ظٹظ„ط©', 3),
(22, 'ط§ظ„ظ…ط±ظƒط²', 4),
(24, 'ط§ظ„ط­ظˆط¨ط§ظ†', 4),
(25, 'ط§ظ„ط®ط¯ظٹط±', 4),
(26, 'ط§ظ„ط±ط²ط§ط¹', 4),
(27, 'ط§ظ„ظ…ط±ظƒط²', 5),
(28, 'ط§ظ„ط¬ط¨ظ„ظٹ', 5),
(29, 'ط§ظ„ط³ظ‡ظ„ظٹ', 5),
(30, 'ط§ظ„ط؛ط±ط¨ظٹ', 5),
(31, 'ط§ظ„ط´ط±ظ‚ظٹ', 5),
(32, 'ط§ظ„ظ…ط±ظƒط²', 6),
(33, 'ط§ظ„ط´ط±ظپ', 6),
(34, 'ط§ظ„ط¸ظ‡ط±', 6),
(35, 'ط§ظ„ظˆط§ط¯ظٹ', 6),
(36, 'ط§ظ„ط¬ط¨ظ„', 6),
(37, 'ط§ظ„ظ…ط±ظƒط²', 7),
(38, 'ط§ظ„ط´ط±ظپ', 7),
(39, 'ط§ظ„ظˆط§ط¯ظٹ', 7),
(40, 'ط§ظ„ط¬ط¨ظ„', 7),
(41, 'ط§ظ„ط³ط§ط­ظ„', 7),
(42, 'ط§ظ„ظ…ط±ظƒط²', 8),
(43, 'ط§ظ„ط´ط±ظپ', 8),
(44, 'ط§ظ„ظˆط§ط¯ظٹ', 8),
(45, 'ط§ظ„ط¬ط¨ظ„', 8),
(46, 'ط§ظ„ط³ط§ط­ظ„', 8),
(47, 'ط§ظ„ظ…ط±ظƒط²', 9),
(48, 'ط§ظ„ط´ط±ظپ', 9),
(49, 'ط§ظ„ظˆط§ط¯ظٹ', 9),
(50, 'ط§ظ„ط¬ط¨ظ„', 9),
(51, 'ط§ظ„ط³ط§ط­ظ„', 9),
(52, 'ط§ظ„ظ…ط±ظƒط²', 10),
(53, 'ط§ظ„ط´ط±ظپ', 10),
(54, 'ط§ظ„ظˆط§ط¯ظٹ', 10),
(55, 'ط§ظ„ط¬ط¨ظ„', 10),
(56, 'ط§ظ„ط³ط§ط­ظ„', 10),
(57, 'ط§ظ„ظ…ط±ظƒط²', 11),
(58, 'ط§ظ„ط´ط±ظپ', 11),
(59, 'ط§ظ„ظˆط§ط¯ظٹ', 11),
(60, 'ط§ظ„ط¬ط¨ظ„', 11),
(61, 'ط§ظ„ط³ط§ط­ظ„', 11),
(62, 'ط§ظ„ظ…ط±ظƒط²', 12),
(63, 'ط§ظ„ط´ط±ظپ', 12),
(64, 'ط§ظ„ظˆط§ط¯ظٹ', 12),
(65, 'ط§ظ„ط¬ط¨ظ„', 12),
(66, 'ط§ظ„ط³ط§ط­ظ„', 12),
(67, 'ط§ظ„ظ…ط±ظƒط²', 13),
(68, 'ط§ظ„ط´ط±ظپ', 13),
(69, 'ط§ظ„ظˆط§ط¯ظٹ', 13),
(70, 'ط§ظ„ط¬ط¨ظ„', 13),
(71, 'ط§ظ„ط³ط§ط­ظ„', 13);

-- --------------------------------------------------------

--
-- ط¨ظ†ظٹط© ط§ظ„ط¬ط¯ظˆظ„ `police_alerts`
--

CREATE TABLE `police_alerts` (
  `alert_id` int(11) NOT NULL,
  `alert_title` varchar(255) NOT NULL,
  `alert_message` text NOT NULL,
  `alert_date` datetime DEFAULT current_timestamp(),
  `target_department` enum('All','Traffic','Criminal','Patrol','Custom') DEFAULT 'All',
  `is_sent` tinyint(1) DEFAULT 0,
  `status` enum('in_progress','completed','rejected') NOT NULL,
  `department_id` int(11) NOT NULL,
  `suspects_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- ط¥ط±ط¬ط§ط¹ ط£ظˆ ط§ط³طھظٹط±ط§ط¯ ط¨ظٹط§ظ†ط§طھ ط§ظ„ط¬ط¯ظˆظ„ `police_alerts`
--

INSERT INTO `police_alerts` (`alert_id`, `alert_title`, `alert_message`, `alert_date`, `target_department`, `is_sent`, `status`, `department_id`, `suspects_id`) VALUES
(2, 'ظ…طھط§ط¨ط¹ظ‡ ط§ظ„ط¨ظ„ط§ط؛', 'ط§ظ„ظ‚ط¨ط¶ ط¹ظ„ظ‰ ط³ط¹ظٹط¯ ', '2025-09-17 00:54:34', 'All', 0, 'completed', 3, 31),
(3, 'kKan', 'Snsn', '2025-09-18 00:51:16', 'All', 0, 'in_progress', 5, 31),
(4, 'kKan', 'Snsn', '2025-09-18 00:51:22', 'All', 0, 'in_progress', 2, 31),
(5, 'ط³ظ„ط§', 'Jsjsjjsjs', '2025-09-18 20:59:06', 'All', 0, 'completed', 3, 31);

-- --------------------------------------------------------

--
-- ط¨ظ†ظٹط© ط§ظ„ط¬ط¯ظˆظ„ `reporters`
--

CREATE TABLE `reporters` (
  `id` int(11) NOT NULL,
  `name_reporter` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `phone_reporter` varchar(20) NOT NULL DEFAULT 'ط؛ظٹط± ظ…ط­ط¯ط¯',
  `email_reporter` varchar(100) NOT NULL DEFAULT 'ظ„ط§ ظٹظˆط¬ط¯',
  `id_national_reporter` varchar(20) NOT NULL DEFAULT 'ط؛ظٹط± ظ…ط¹ط±ظˆظپ',
  `address_reporter` text NOT NULL DEFAULT 'ظ„ظ… ظٹطھظ… ط§ظ„طھط­ط¯ظٹط¯',
  `districts_id` int(11) NOT NULL,
  `neighborhoods_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci;

--
-- ط¥ط±ط¬ط§ط¹ ط£ظˆ ط§ط³طھظٹط±ط§ط¯ ط¨ظٹط§ظ†ط§طھ ط§ظ„ط¬ط¯ظˆظ„ `reporters`
--

INSERT INTO `reporters` (`id`, `name_reporter`, `phone_reporter`, `email_reporter`, `id_national_reporter`, `address_reporter`, `districts_id`, `neighborhoods_id`) VALUES
(1, 'ظ…ط­ظ…ط¯ ط¹ظ„ظٹ ط³ط¹ظٹط¯ ظ‚ط§ط¦ط¯ ', '772736183', 'mohhamed@gmail.com', '7779182882', 'ط§ظ„ط±ظˆط¸ط© ', 1, 1),
(6, 'ط£ط­ظ…ط¯ ط¹ظ„ظٹ ط³ط¹ظٹط¯', '777123456', 'ahmed@example.com', '1234567890', 'طµظ†ط¹ط§ط، - ط´ط§ط±ط¹ ط§ظ„ط²ط¨ظٹط±ظٹ', 1, 1),
(46, 'ظ…ط­ظ…ط¯ ط¹ط¨ط¯ ط§ظ„ط±ط­ظ…ظ†', '775678901', 'mohamed.abdulrahman@email.com', '2233445566', 'ط´ط§ط±ط¹ ط§ظ„ط´ظ‡ط¯ط§ط، - ظ…ط¨ظ†ظ‰ 7', 1, 8),
(47, 'ط£ظ…ظٹط±ط© ط­ط³ظ† ط¹ظ„ظٹ', '776789012', 'amira.hassan@email.com', '3344556677', 'ط­ظٹ ط§ظ„ظˆط­ط¯ط© - ظ…ط¨ظ†ظ‰ 18', 1, 6),
(48, 'ط®ط§ظ„ط¯ ط¥ط¨ط±ط§ظ‡ظٹظ… ط£ط­ظ…ط¯', '777890123', 'khaled.ibrahim@email.com', '4455667788', 'ط­ظٹ ط§ظ„ط­ط±ظٹط© - ظ…ط¨ظ†ظ‰ 25', 1, 5),
(49, 'ظ†ظˆط±ط© ط³ط¹ظٹط¯ ظ…ط­ظ…ط¯', '778901234', 'nora.saeed@email.com', '5566778899', 'ط­ظٹ ط§ظ„طھط­ط±ظٹط± - ظ…ط¨ظ†ظ‰ 30', 1, 7),
(50, 'ظٹط§ط³ط± ط¹ط¨ط¯ ط§ظ„ظ„ظ‡', '779012345', 'yasser.abdullah@email.com', '6677889900', 'ط­ظٹ ط§ظ„ط²ظ‡ط±ط§ط، - ظ…ط¨ظ†ظ‰ 9', 1, 9),
(51, 'ظ‡ط¯ظٹظ„ ط¹ظ„ظٹ ط­ط³ظٹظ†', '770123456', 'hadeel.ali@email.com', '7788990011', 'ط­ظٹ ط§ظ„ط§طµط¨ط­ظٹ - ظ…ط¨ظ†ظ‰ 14', 1, 10),
(52, 'ط¹ظ…ط± ظ…ط­ظ…ط¯ ط³ط§ظ„ظ…', '771234567', 'omar.mohamed@email.com', '8899001122', 'ط´ط§ط±ط¹ ط§ظ„ط«ظˆط±ط© - ظ…ط¨ظ†ظ‰ 22', 1, 3),
(53, 'ظ„ظٹظ†ط§ ط£ط­ظ…ط¯ ط¹ط¨ط¯', '772345678', 'lena.ahmed@email.com', '9900112233', 'ط­ظٹ ط§ظ„ط³ظ„ط§ظ… - ظ…ط¨ظ†ظ‰ 11', 1, 4),
(54, 'ظ…ط­ظ…ط¯ ط¹ط¨ط¯ ط§ظ„ط±ط­ظ…ظ†', '775678901', 'mohamed.abdulrahman@email.com', '2233445566', 'ط´ط§ط±ط¹ ط§ظ„ط´ظ‡ط¯ط§ط، - ظ…ط¨ظ†ظ‰ 7', 1, 8),
(55, 'ط£ظ…ظٹط±ط© ط­ط³ظ† ط¹ظ„ظٹ', '776789012', 'amira.hassan@email.com', '3344556677', 'ط­ظٹ ط§ظ„ظˆط­ط¯ط© - ظ…ط¨ظ†ظ‰ 18', 1, 6),
(56, 'ط®ط§ظ„ط¯ ط¥ط¨ط±ط§ظ‡ظٹظ… ط£ط­ظ…ط¯', '777890123', 'khaled.ibrahim@email.com', '4455667788', 'ط­ظٹ ط§ظ„ط­ط±ظٹط© - ظ…ط¨ظ†ظ‰ 25', 1, 5),
(57, 'ظ†ظˆط±ط© ط³ط¹ظٹط¯ ظ…ط­ظ…ط¯', '778901234', 'nora.saeed@email.com', '5566778899', 'ط­ظٹ ط§ظ„طھط­ط±ظٹط± - ظ…ط¨ظ†ظ‰ 30', 1, 7),
(58, 'ظٹط§ط³ط± ط¹ط¨ط¯ ط§ظ„ظ„ظ‡', '779012345', 'yasser.abdullah@email.com', '6677889900', 'ط­ظٹ ط§ظ„ط²ظ‡ط±ط§ط، - ظ…ط¨ظ†ظ‰ 9', 1, 9),
(59, 'ظ‡ط¯ظٹظ„ ط¹ظ„ظٹ ط­ط³ظٹظ†', '770123456', 'hadeel.ali@email.com', '7788990011', 'ط­ظٹ ط§ظ„ط§طµط¨ط­ظٹ - ظ…ط¨ظ†ظ‰ 14', 1, 10),
(60, 'ط¹ظ…ط± ظ…ط­ظ…ط¯ ط³ط§ظ„ظ…', '771234567', 'omar.mohamed@email.com', '8899001122', 'ط´ط§ط±ط¹ ط§ظ„ط«ظˆط±ط© - ظ…ط¨ظ†ظ‰ 22', 1, 3),
(61, 'ظ„ظٹظ†ط§ ط£ط­ظ…ط¯ ط¹ط¨ط¯', '772345678', 'lena.ahmed@email.com', '9900112233', 'ط­ظٹ ط§ظ„ط³ظ„ط§ظ… - ظ…ط¨ظ†ظ‰ 11', 1, 4),
(77, 'ظ…ط­ظ…ط¯ ط¹ظ„ظٹ ط³ط¹ظٹط¯', '77782888', 'alijsjsjsjs', '8181818', '828828', 9, 48),
(78, 'ظ…ط­ظ…ط¯ ط¹ظ„ظٹ ط³ط¹ظٹط¯', '77782888', 'abdullahaldys9004@gmail.com', '8181818', '828828', 9, 48),
(79, 'ط§ظٹظ‡ط§ط¨ ظپظٹطµظ„ ظ†ط¹ظ…ط§ظ† ط§ظ„ظ†ط¹ظ…ط§ظ†ظٹ ', '777282882', 'abdullahaldys@gmail.ckm', '8263829472738', 'ط·ظٹط¨ط© ', 1, 1),
(80, 'ط§ظٹظ‡ط§ط¨ ظپظٹطµظ„ ظ†ط¹ظ…ط§ظ† ط§ظ„ظ†ط¹ظ…ط§ظ†ظٹ ', '777282882', 'abdullahaldys@gmail.ckm', '8263829472738', 'ط·ظٹط¨ط© ', 1, 1),
(81, 'ط§ظٹظ‡ط§ط¨ ظپظٹطµظ„ ظ†ط¹ظ…ط§ظ† ط§ظ„ظ†ط¹ظ…ط§ظ†ظٹ ', '777282882', 'abdullahaldys@gmail.ckm', '8263829472738', 'ط·ظٹط¨ط© ', 1, 1),
(82, 'ظ‚ط§ط¦ط¯ ط¹ط¨ط¯ط§ظ„ظ„ظ‡ ط§ط­ظ…ط¯ ط¹ظ„ظٹ ', '0583728373', 'abdullahaldys9003@gmail.com', '1837383827', 'Jsjsnsnsnsnjs', 1, 4),
(83, 'ghghgh hgghh', '776567676', 'abf@gmail.com', '8776654567', 'hghghghghgghgghh', 2, 13),
(84, 'ط¹ظ…ط§ط±', '777222888', 'abdullahaldys9004@gmail.com', '828282882', 'Jsjsjsjsj', 2, 13),
(85, 'ط¹ط¨ط¯ظ‡ ظ…ط­ظ…ط¯ ط¹ظ„ظٹ', 'ط³ط¹ظٹط¯ ط¹ط¨ط¯ط© ', 'abdullahaldys9004@gmail.com', '8181881888', 'ظپظٹ ظ…ط³طھط´ظپظ‰ ط§ظ„ط±ظˆط¸ط© ', 2, 13),
(86, 'ظ…ط­ظ…ط¯ ط¹ط¨ط¯ظ‡ ط³ط¹ظٹط¯ ', '77728282', 'abdullahaldys9004@gmail.com', '628838383', 'ط·ظٹط¨ط© ط§ظ„ظ‚ط§ظ‡ط±ط©', 2, 13),
(87, 'ط³ط¹ظٹط¯ ط¹ظ„ظٹ ط¹ط¨ط¯ط© ', '770002728', 'abdullahaldys9004@gmail.com', '82737278', 'طµظ†ط¹ط§ط، ', 2, 14),
(88, 'ط¹ط¨ط¯ط§ظ„ظ„ظ‡ ط§ط­ظ…ط¯ ط¹ظ„ظٹ ', '7749392', 'abdullahaldys9004@gmail.com', '82282882', 'ط§ظ„طھط­ط±ظٹط± ط§ظ„ط§ط³ظپظ„', 7, 39),
(89, 'ط¹ظ…ط§ط± ط¹ط¨ط¯ط§ظ„ط¹ط²ظٹط² ط³ط¹ظٹط¯ ظ‚ط§ط¦ط¯ ط³ط¹ظٹط¯ ', '7772222681', 'abdullahaldys9004@gmail.com', '8262627', 'ط§ظ„طھط­ط±ظٹط± ط§ظ„ط§ط³ظپظ„ طھط¹ط²', 6, 32),
(90, 'ظ†ط³ظ†ط³ظ†ظ†ظٹظ†ظٹhajajajaa', '8777272', 'abdullahaldys9004@gmail.com', '8181881', 'Jajsjsjs', 1, 1),
(96, 'Jsjsjsj nananannaa', '8777272', 'abdullahaldys9004@gmail.com', '8181881', 'Hahahhhh', 1, 1),
(97, 'Jsjsjsj nananannaa', '8777274', 'abdullahaldys9004@gmail.com', '8181881', 'Hahahhhh', 1, 1),
(98, 'Jsjsjsj nananannaa', '8777274', 'abdullahaldys9004@gmail.com', '8181881', 'Hahahhhh', 1, 1),
(99, 'ظ…ط­ظ†ط¯ hshshah ajjjaja', '7777', 'abdullahaldys9004@gmail.com', '7373737373', 'Hshshs', 1, 1),
(100, 'ظ…ط­ظ†ط¯ hshshah ajjjaja', '7777', 'abdullahaldys9004@gmail.com', '7373737373', 'Hshshs', 1, 1),
(101, 'ظ…ط­ظ†ط¯ hshshah ajjjaja', '7777', 'abdullahaldys9004@gmail.com', '7373737373', 'Hshshs', 1, 1),
(102, 'ظ…ط­ظ†ط¯ hshshah ajjjaja', '7777', 'abdullahaldys9004@gmail.com', '7373737373', 'Hshshs', 1, 1),
(103, 'ظ…ط­ظ†ط¯ hshshah ajjjaja', '7777', 'abdullahaldys9004@gmail.com', '7373737373', 'Hshshs', 1, 1),
(104, 'ظ…ط­ظ†ط¯ hshshah ajjjaja', '7777', 'abdullahaldys9004@gmail.com', '7373737373', 'Hshshs', 1, 1),
(105, 'ظ…ط­ظ†ط¯ hshshah ajjjaja', '7777', 'abdullahaldys9004@gmail.com', '7373737373', 'Hshshs', 1, 1),
(106, 'ظ…ط­ظ†ط¯ hshshah ajjjaja', '7777', 'abdullahaldys9004@gmail.com', '7373737373', 'Hshshs', 1, 1),
(107, 'ظ…ط­ظ†ط¯ hshshah ajjjaja', '7777', 'abdullahaldys9004@gmail.com', '7373737373', 'Hshshs', 1, 1),
(108, 'ظ…ط­ظ†ط¯ hshshah ajjjaja', '7777', 'abdullahaldys9004@gmail.com', '7373737373', 'Hshshs', 1, 1),
(109, 'ظ…ط­ظ†ط¯ hshshah ajjjaja', '7777', 'abdullahaldys9004@gmail.com', '7373737373', 'Hshshs', 1, 1),
(110, 'ظ…ط­ظ†ط¯ hshshah ajjjaja', '7777', 'abdullahaldys9004@gmail.com', '7373737373', 'Hshshs', 1, 1),
(111, 'ظ…ط­ظ†ط¯ hshshah ajjjaja', '7777', 'abdullahaldys9004@gmail.com', '7373737373', 'Hshshs', 1, 1),
(112, 'ظ…ط­ظ†ط¯ hshshah ajjjaja', '7777', 'abdullahaldys9004@gmail.com', '7373737373', 'Hshshs', 1, 1),
(113, 'ظ…ط­ظ†ط¯ hshshah ajjjaja', '7777', 'abdullahaldys9004@gmail.com', '7373737373', 'Hshshs', 1, 1),
(114, 'ظ…ط­ظ†ط¯ hshshah ajjjaja', '7777', 'abdullahaldys9004@gmail.com', '7373737373', 'Hshshs', 1, 1),
(115, 'ظ…ط­ظ†ط¯ hshshah ajjjaja', '7777', 'abdullahaldys9004@gmail.com', '7373737373', 'Hshshs', 1, 1),
(116, 'ظ…ط­ظ†ط¯ hshshah ajjjaja', '7777', 'abdullahaldys9004@gmail.com', '7373737373', 'Hshshs', 1, 1),
(117, 'ظ…ط­ظ†ط¯ hshshah ajjjaja', '7777', 'abdullahaldys9004@gmail.com', '7373737373', 'Hshshs', 1, 1),
(118, 'ظ…ط­ظ†ط¯ hshshah ajjjaja', '7777', 'abdullahaldys9004@gmail.com', '7373737373', 'Hshshs', 1, 1),
(119, 'ظ…ط­ظ†ط¯ hshshah ajjjaja', '7777', 'abdullahaldys9004@gmail.com', '7373737373', 'Hshshs', 1, 1),
(120, 'Jajjajajajsjajaj', '77777', 'abdullahaldys9004@gmail.com', '82828828228', 'Jajsjsjsj', 1, 1),
(121, 'Jajjajajajsjajaj', '77777', 'abdullahaldys9004@gmail.com', '82828828228', 'Jajsjsjsj', 1, 1),
(122, 'Jajjajajajsjajaj', '77777', 'abdullahaldys9004@gmail.com', '82828828228', 'Jajsjsjsj', 1, 1),
(123, 'Jajjajajajsjajaj', '77777', 'abdullahaldys9004@gmail.com', '82828828228', 'Jajsjsjsj', 1, 1),
(124, 'Jajjajajajsjajaj', '77777', 'abdullahaldys9004@gmail.com', '82828828228', 'Jajsjsjsj', 1, 1),
(125, 'Jajjajajajsjajaj', '77777', 'abdullahaldys9004@gmail.com', '82828828228', 'Jajsjsjsj', 1, 1),
(126, 'طھط³ظ†ط³ظ†jajajajjaja', 'Jahajaj', 'hahaaj@gmail.com', 'Hahahajha', 'Hahhaah', 1, 1),
(127, 'ط¹ط¨ط¯ط§ظ„ظ„ظ‡ ط¹ط¨ط¯ط§ظ„ط¹ط²ظٹط²', '7333454686', 'abdullahaldys9004@gmail.com', '7272882', 'ظ…ط³طھط´ظپظ‰ ط·ظٹط¨ط© ', 1, 1);

-- --------------------------------------------------------

--
-- ط¨ظ†ظٹط© ط§ظ„ط¬ط¯ظˆظ„ `reports`
--

CREATE TABLE `reports` (
  `report_id` int(11) NOT NULL,
  `report_number` varchar(50) NOT NULL,
  `description` text NOT NULL,
  `main_id` int(11) UNSIGNED NOT NULL,
  `sub_id` int(11) UNSIGNED NOT NULL,
  `status_report` enum('opened','closed','prosse') NOT NULL DEFAULT 'opened',
  `districts_id` int(11) NOT NULL,
  `neighborhoods_id` int(11) NOT NULL,
  `archive` tinyint(4) DEFAULT 0,
  `created_at` datetime DEFAULT current_timestamp(),
  `updated_at` datetime DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- ط¥ط±ط¬ط§ط¹ ط£ظˆ ط§ط³طھظٹط±ط§ط¯ ط¨ظٹط§ظ†ط§طھ ط§ظ„ط¬ط¯ظˆظ„ `reports`
--

INSERT INTO `reports` (`report_id`, `report_number`, `description`, `main_id`, `sub_id`, `status_report`, `districts_id`, `neighborhoods_id`, `archive`, `created_at`, `updated_at`) VALUES
(49, 'RPT49', 'ظ‚ظ†ظ„ ط°ط§ظ„ظƒ ط¨ط§ظ„ط´ط®طµ ', 1, 16, 'prosse', 8, 43, 0, '2025-07-26 19:27:44', '2025-10-05 01:40:00'),
(50, 'RPT50', 'ظ‚ظ†ظ„ ط°ط§ظ„ظƒ ط¨ط§ظ„ط´ط®طµ ', 1, 16, 'prosse', 8, 43, 0, '2025-07-28 11:27:44', '2025-10-05 01:40:00'),
(57, 'RPT57', 'ظ‚ط§ظ…  ظپظٹ ط§ظ„ط§ط¹طھط¯ط§ط، ط¹ظ„ظ‰ ظ…ط¬ظ…ظˆطھط¹ ط§ط´ط®ط§طµ ظپظٹ ط·ظٹط¨ط© ط¨ط§ظ„ط³ظ„ط§ط­ ', 2, 21, 'prosse', 2, 13, 0, '2025-07-25 21:27:44', '2025-10-05 01:40:00'),
(60, 'RPT60', 'Nsnsnsnnsjsjajajsjjsj', 1, 16, 'prosse', 1, 3, 0, '2025-07-08 01:27:44', '2025-10-05 01:40:00'),
(63, 'RPT63', 'ظ‚ط§ظ… ظپط¨ ط³ط±ظ‚ط© ط§ظ„ظ…ط­ظ„ط§ط§طھ ط§ظ„طھط¬ط§ط±ظٹط© ظ„ظٹظ„ط§', 1, 17, 'opened', 2, 13, 0, '2025-07-16 15:27:44', '2025-10-05 01:40:00'),
(65, 'RPT65', 'ظ‚ط§ظ… ظپظٹ ط³ط±ظ‚ط© ظ…ظ†ط²ظ„ ', 1, 16, 'opened', 1, 4, 0, '2025-07-22 23:27:44', '2025-10-05 01:40:00'),
(66, 'RPT66', 'ط³ط±ظ‚ط© ط§ظ„ظ…ظ†ط§gط²ظ„ ظˆط§ظ„ط¹ظ‚ط§ط±ط§طھ jg ظˆط³ط±ظ‚ط© ط§ظ„ظ…ط¹ظ„ظˆظ…ط§طھ ظ…ظ† ط§ظ„ط§ظ…ط§ظƒظ† ط§ظ„ط؛ظٹط± ظ…ط±ط؛ظˆط¨ ط¨ظ‡ط§ ', 1, 18, 'opened', 3, 18, 0, '2025-07-28 20:27:44', '2025-10-05 01:40:00'),
(67, 'RPT67', 'طھظ… ط§ط®طھط·ط§ظپ ط·ظپط§ ', 4, 28, 'opened', 1, 7, 0, '2025-07-09 05:27:44', '2025-10-05 01:40:00'),
(68, 'RPT68', 'Hshshshshshs.', 2, 21, 'opened', 5, 29, 0, '2025-07-13 16:27:44', '2025-10-05 01:40:00'),
(70, 'RPT70', 'ط¨ظ„ط§ط؛ ط§ط®طھط¨ط§ط± 1 - ط¬ط±ط§ط¦ظ… ط§ظ„ط³ط±ظ‚ط© - ط³ط±ظ‚ط© ظ…ظ†ط§ط²ظ„', 1, 16, 'prosse', 1, 1, 0, '2025-10-03 23:27:44', '2025-10-05 01:40:00'),
(71, 'RPT71', 'ط¨ظ„ط§ط؛ ط§ط®طھط¨ط§ط± 2 - ط¬ط±ط§ط¦ظ… ط§ظ„ط³ط±ظ‚ط© - ط³ط±ظ‚ط© ظ…ط­ظ„ط§طھ طھط¬ط§ط±ظٹط©', 1, 17, 'closed', 1, 1, 0, '2025-10-04 00:27:44', '2025-10-05 01:40:00'),
(72, 'RPT72', 'ط¨ظ„ط§ط؛ ط§ط®طھط¨ط§ط± 3 - ط¬ط±ط§ط¦ظ… ط§ظ„ط³ط±ظ‚ط© - ط³ط±ظ‚ط© ط³ظٹط§ط±ط§طھ', 1, 18, 'closed', 1, 1, 0, '2025-10-03 03:27:44', '2025-10-05 01:40:00'),
(73, 'RPT73', 'ط¨ظ„ط§ط؛ ط§ط®طھط¨ط§ط± 4 - ط¬ط±ط§ط¦ظ… ط§ظ„ط³ط±ظ‚ط© - ط³ط±ظ‚ط© ظ…ط³ظ„ط­ط©', 1, 19, 'closed', 1, 1, 0, '2025-10-03 15:27:44', '2025-10-05 01:40:00'),
(74, 'RPT74', 'ط¨ظ„ط§ط؛ ط§ط®طھط¨ط§ط± 5 - ط¬ط±ط§ط¦ظ… ط§ظ„ط³ط±ظ‚ط© - ظ†ط´ظ„ ظˆط³ط±ظ‚ط© ظ…ط­ط§ظپط¸', 1, 20, 'closed', 1, 1, 0, '2025-10-02 16:27:44', '2025-10-05 01:40:00'),
(75, 'RPT75', 'ط¨ظ„ط§ط؛ ط§ط®طھط¨ط§ط± 6 - ط§ظ„ط¥ط¹طھط¯ط§ط، - ط§ط¹طھط¯ط§ط، ط¨ط§ظ„ط³ظ„ط§ط­ ط§ظ„ط£ط¨ظٹط¶', 2, 21, 'closed', 1, 1, 0, '2025-10-02 12:27:44', '2025-10-05 01:40:00'),
(76, 'RPT76', 'ط¨ظ„ط§ط؛ ط§ط®طھط¨ط§ط± 7 - ط§ظ„ط¥ط¹طھط¯ط§ط، - ط§ط¹طھط¯ط§ط، ط¨ط§ظ„ط³ظ„ط§ط­ ط§ظ„ظ†ط§ط±ظٹ', 2, 22, 'prosse', 1, 1, 0, '2025-10-02 10:27:44', '2025-10-05 01:40:00'),
(77, 'RPT77', 'ط¨ظ„ط§ط؛ ط§ط®طھط¨ط§ط± 8 - ط§ظ„ط¥ط¹طھط¯ط§ط، - ط§ط¹طھط¯ط§ط، ط¬ط³ط¯ظٹ ظ…ط¨ط±ط­', 2, 23, 'closed', 1, 1, 0, '2025-10-02 16:27:44', '2025-10-05 01:40:00'),
(78, 'RPT78', 'ط¨ظ„ط§ط؛ ط§ط®طھط¨ط§ط± 9 - ط§ظ„ط¥ط¹طھط¯ط§ط، - ط§ط¹طھط¯ط§ط، ط¬ظ†ط³ظٹ', 2, 24, 'prosse', 1, 1, 0, '2025-10-01 23:27:44', '2025-10-05 01:40:00'),
(79, 'RPT79', 'ط¨ظ„ط§ط؛ ط§ط®طھط¨ط§ط± 10 - ط¬ط±ط§ط¦ظ… ط§ظ„ظ…ط®ط¯ط±ط§طھ - ط§طھط¬ط§ط± ط¨ط§ظ„ظ…ط®ط¯ط±ط§طھ', 3, 25, 'closed', 1, 1, 0, '2025-10-02 00:27:44', '2025-10-05 01:40:00'),
(80, 'RPT80', 'ط¨ظ„ط§ط؛ ط§ط®طھط¨ط§ط± 11 - ط¬ط±ط§ط¦ظ… ط§ظ„ظ…ط®ط¯ط±ط§طھ - طھظˆط²ظٹط¹ ظ…ط®ط¯ط±ط§طھ', 3, 26, 'prosse', 1, 1, 0, '2025-09-27 02:27:44', '2025-10-05 01:40:00'),
(81, 'RPT81', 'ط¨ظ„ط§ط؛ ط§ط®طھط¨ط§ط± 12 - ط¬ط±ط§ط¦ظ… ط§ظ„ظ…ط®ط¯ط±ط§طھ - ط­ظٹط§ط²ط© ظ…ط®ط¯ط±ط§طھ ط¨ظƒظ…ظٹط§طھ ظƒط¨ظٹط±ط©', 3, 27, 'opened', 1, 1, 0, '2025-09-27 11:27:44', '2025-10-05 01:40:00'),
(82, 'RPT82', 'ط¨ظ„ط§ط؛ ط§ط®طھط¨ط§ط± 13 - ط¬ط±ط§ط¦ظ… ط§ظ„ط§ط®طھط·ط§ظپ - ط§ط®طھط·ط§ظپ ط·ظپظ„', 4, 28, 'closed', 1, 1, 0, '2025-09-29 02:27:44', '2025-10-05 01:40:00'),
(83, 'RPT83', 'ط¨ظ„ط§ط؛ ط§ط®طھط¨ط§ط± 14 - ط¬ط±ط§ط¦ظ… ط§ظ„ط§ط®طھط·ط§ظپ - ط§ط®طھط·ط§ظپ ط¨ط§ظ„ط؛', 4, 29, 'closed', 1, 1, 0, '2025-09-30 22:27:44', '2025-10-05 01:40:00'),
(84, 'RPT84', 'ط¨ظ„ط§ط؛ ط§ط®طھط¨ط§ط± 15 - ط¬ط±ط§ط¦ظ… ط§ظ„ط§ط®طھط·ط§ظپ - ط§ط®طھط·ط§ظپ ط·ظ„ط¨ ظپط¯ظٹط©', 4, 30, 'prosse', 1, 1, 0, '2025-09-30 07:27:44', '2025-10-05 01:40:00'),
(85, 'RPT85', 'ط¨ظ„ط§ط؛ ط§ط®طھط¨ط§ط± 16 - ط¬ط±ط§ط¦ظ… ط§ظ„طھظ‡ط¯ظٹط¯ ظˆط§ظ„ط§ط¨طھط²ط§ط² - طھظ‡ط¯ظٹط¯ ط¨ط§ظ„ظ‚طھظ„', 5, 31, 'opened', 1, 1, 0, '2025-09-02 22:27:44', '2025-10-05 01:40:00'),
(86, 'RPT86', 'ط¨ظ„ط§ط؛ ط§ط®طھط¨ط§ط± 17 - ط¬ط±ط§ط¦ظ… ط§ظ„طھظ‡ط¯ظٹط¯ ظˆط§ظ„ط§ط¨طھط²ط§ط² - ط§ط¨طھط²ط§ط² ط¥ظ„ظƒطھط±ظˆظ†ظٹ', 5, 32, 'closed', 1, 1, 0, '2025-08-30 07:27:44', '2025-10-05 01:40:00'),
(87, 'RPT87', 'ط¨ظ„ط§ط؛ ط§ط®طھط¨ط§ط± 18 - ط¬ط±ط§ط¦ظ… ط§ظ„طھظ‡ط¯ظٹط¯ ظˆط§ظ„ط§ط¨طھط²ط§ط² - ط§ط¨طھط²ط§ط² ظ…ط§ظ„ظٹ', 5, 33, 'prosse', 1, 1, 0, '2025-08-29 15:27:44', '2025-10-05 01:40:00'),
(88, 'RPT88', 'ط¨ظ„ط§ط؛ ط§ط®طھط¨ط§ط± 19 - ط¬ط±ط§ط¦ظ… ط§ظ„ظ‚طھظ„ - ظ‚طھظ„ ط¹ظ…ط¯', 6, 34, 'opened', 1, 1, 0, '2025-08-22 05:27:44', '2025-10-05 01:40:00'),
(89, 'RPT89', 'ط¨ظ„ط§ط؛ ط§ط®طھط¨ط§ط± 20 - ط¬ط±ط§ط¦ظ… ط§ظ„ظ‚طھظ„ - ظ‚طھظ„ ط®ط·ط£', 6, 35, 'prosse', 1, 1, 0, '2025-09-01 03:27:44', '2025-10-05 01:40:00'),
(108, 'RPT108', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 1 - ط¬ط±ط§ط¦ظ… ط§ظ„ط³ط±ظ‚ط© - ط³ط±ظ‚ط© ظ…ظ†ط§ط²ظ„', 1, 16, 'closed', 1, 1, 0, '2025-10-23 00:00:00', '2025-10-05 01:40:00'),
(109, 'RPT109', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 2 - ط¬ط±ط§ط¦ظ… ط§ظ„ط³ط±ظ‚ط© - ط³ط±ظ‚ط© ظ…ط­ظ„ط§طھ طھط¬ط§ط±ظٹط©', 1, 17, 'opened', 1, 2, 0, '2025-10-26 00:00:00', '2025-10-05 01:40:00'),
(110, 'RPT110', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 3 - ط¬ط±ط§ط¦ظ… ط§ظ„ط³ط±ظ‚ط© - ط³ط±ظ‚ط© ط³ظٹط§ط±ط§طھ', 1, 18, 'opened', 1, 3, 0, '2025-10-16 00:00:00', '2025-10-05 01:40:00'),
(111, 'RPT111', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 4 - ط¬ط±ط§ط¦ظ… ط§ظ„ط³ط±ظ‚ط© - ط³ط±ظ‚ط© ظ…ط³ظ„ط­ط©', 1, 19, 'prosse', 1, 4, 0, '2025-10-06 00:00:00', '2025-10-05 01:40:00'),
(112, 'RPT112', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 5 - ط¬ط±ط§ط¦ظ… ط§ظ„ط³ط±ظ‚ط© - ظ†ط´ظ„ ظˆط³ط±ظ‚ط© ظ…ط­ط§ظپط¸', 1, 20, 'prosse', 1, 5, 0, '2025-10-28 00:00:00', '2025-10-05 01:40:00'),
(113, 'RPT113', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 6 - ط§ظ„ط¥ط¹طھط¯ط§ط، - ط§ط¹طھط¯ط§ط، ط¨ط§ظ„ط³ظ„ط§ط­ ط§ظ„ط£ط¨ظٹط¶', 2, 21, 'opened', 1, 6, 0, '2025-10-23 00:00:00', '2025-10-05 01:40:00'),
(114, 'RPT114', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 7 - ط§ظ„ط¥ط¹طھط¯ط§ط، - ط§ط¹طھط¯ط§ط، ط¨ط§ظ„ط³ظ„ط§ط­ ط§ظ„ظ†ط§ط±ظٹ', 2, 22, 'closed', 1, 7, 0, '2025-10-07 00:00:00', '2025-10-05 01:40:00'),
(115, 'RPT115', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 8 - ط§ظ„ط¥ط¹طھط¯ط§ط، - ط§ط¹طھط¯ط§ط، ط¬ط³ط¯ظٹ ظ…ط¨ط±ط­', 2, 23, 'prosse', 1, 8, 0, '2025-10-06 00:00:00', '2025-10-05 01:40:00'),
(116, 'RPT116', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 9 - ط§ظ„ط¥ط¹طھط¯ط§ط، - ط§ط¹طھط¯ط§ط، ط¬ظ†ط³ظٹ', 2, 24, 'prosse', 1, 9, 0, '2025-10-28 00:00:00', '2025-10-05 01:40:00'),
(117, 'RPT117', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 10 - ط¬ط±ط§ط¦ظ… ط§ظ„ظ…ط®ط¯ط±ط§طھ - ط§طھط¬ط§ط± ط¨ط§ظ„ظ…ط®ط¯ط±ط§طھ', 3, 25, 'opened', 1, 10, 0, '2025-10-28 00:00:00', '2025-10-07 01:19:57'),
(118, 'RPT118', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 11 - ط¬ط±ط§ط¦ظ… ط§ظ„ظ…ط®ط¯ط±ط§طھ - طھظˆط²ظٹط¹ ظ…ط®ط¯ط±ط§طھ', 3, 26, 'closed', 1, 11, 0, '2025-09-29 00:00:00', '2025-10-05 01:40:00'),
(119, 'RPT119', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 12 - ط¬ط±ط§ط¦ظ… ط§ظ„ظ…ط®ط¯ط±ط§طھ - ط­ظٹط§ط²ط© ظ…ط®ط¯ط±ط§طھ ط¨ظƒظ…ظٹط§طھ ظƒط¨ظٹط±ط©', 3, 27, 'closed', 2, 12, 0, '2025-09-25 00:00:00', '2025-10-05 01:40:00'),
(120, 'RPT120', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 13 - ط¬ط±ط§ط¦ظ… ط§ظ„ط§ط®طھط·ط§ظپ - ط§ط®طھط·ط§ظپ ط·ظپظ„', 4, 28, 'prosse', 2, 13, 0, '2025-09-29 00:00:00', '2025-10-05 01:40:00'),
(121, 'RPT121', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 14 - ط¬ط±ط§ط¦ظ… ط§ظ„ط§ط®طھط·ط§ظپ - ط§ط®طھط·ط§ظپ ط¨ط§ظ„ط؛', 4, 29, 'prosse', 2, 14, 0, '2025-09-17 00:00:00', '2025-10-05 01:40:00'),
(122, 'RPT122', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 15 - ط¬ط±ط§ط¦ظ… ط§ظ„ط§ط®طھط·ط§ظپ - ط§ط®طھط·ط§ظپ ط·ظ„ط¨ ظپط¯ظٹط©', 4, 30, 'prosse', 2, 15, 0, '2025-09-04 00:00:00', '2025-10-05 01:40:00'),
(123, 'RPT123', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 16 - ط¬ط±ط§ط¦ظ… ط§ظ„طھظ‡ط¯ظٹط¯ ظˆط§ظ„ط§ط¨طھط²ط§ط² - طھظ‡ط¯ظٹط¯ ط¨ط§ظ„ظ‚طھظ„', 5, 31, 'prosse', 2, 16, 0, '2025-09-22 00:00:00', '2025-10-05 01:40:00'),
(124, 'RPT124', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 17 - ط¬ط±ط§ط¦ظ… ط§ظ„طھظ‡ط¯ظٹط¯ ظˆط§ظ„ط§ط¨طھط²ط§ط² - ط§ط¨طھط²ط§ط² ط¥ظ„ظƒطھط±ظˆظ†ظٹ', 5, 32, 'prosse', 3, 17, 0, '2025-09-19 00:00:00', '2025-10-05 01:40:00'),
(125, 'RPT125', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 18 - ط¬ط±ط§ط¦ظ… ط§ظ„طھظ‡ط¯ظٹط¯ ظˆط§ظ„ط§ط¨طھط²ط§ط² - ط§ط¨طھط²ط§ط² ظ…ط§ظ„ظٹ', 5, 33, 'closed', 3, 18, 0, '2025-09-12 00:00:00', '2025-10-05 01:40:00'),
(126, 'RPT126', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 19 - ط¬ط±ط§ط¦ظ… ط§ظ„ظ‚طھظ„ - ظ‚طھظ„ ط¹ظ…ط¯', 6, 34, 'prosse', 3, 19, 0, '2025-09-24 00:00:00', '2025-10-05 01:40:00'),
(127, 'RPT127', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 20 - ط¬ط±ط§ط¦ظ… ط§ظ„ظ‚طھظ„ - ظ‚طھظ„ ط®ط·ط£', 6, 35, 'closed', 3, 20, 0, '2025-09-20 00:00:00', '2025-10-05 01:40:00'),
(128, 'RPT128', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 21 - ط¬ط±ط§ط¦ظ… ط§ظ„ظ‚طھظ„ - ط´ط±ظˆط¹ ظ‚طھظ„', 6, 36, 'closed', 3, 21, 0, '2025-08-07 00:00:00', '2025-10-05 01:40:00'),
(129, 'RPT129', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 22 - ط¬ط±ط§ط¦ظ… ط§ظ„ط­ط±ط§ط¦ظ‚ ط§ظ„ظ…طھط¹ظ…ط¯ط© - ط­ط±ظٹظ‚ ظ…طھط¹ظ…ط¯ ظ„ظ…ط¨ظ†ظ‰', 7, 37, 'closed', 4, 22, 0, '2025-08-19 00:00:00', '2025-10-05 01:40:00'),
(130, 'RPT130', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 23 - ط¬ط±ط§ط¦ظ… ط§ظ„ط­ط±ط§ط¦ظ‚ ط§ظ„ظ…طھط¹ظ…ط¯ط© - ط­ط±ظٹظ‚ ظ…طھط¹ظ…ط¯ ظ„ظ…ط±ظƒط¨ط©', 7, 38, 'closed', 4, 24, 0, '2025-08-17 00:00:00', '2025-10-05 01:40:00'),
(131, 'RPT131', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 24 - ط¬ط±ط§ط¦ظ… ط§ظ„طھط²ظˆظٹط± - طھط²ظˆظٹط± ظ…ط³طھظ†ط¯ط§طھ ط±ط³ظ…ظٹط©', 8, 39, 'opened', 4, 25, 0, '2025-08-16 00:00:00', '2025-10-05 01:40:00'),
(132, 'RPT132', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 25 - ط¬ط±ط§ط¦ظ… ط§ظ„طھط²ظˆظٹط± - طھط²ظˆظٹط± ط¹ظ…ظ„ط©', 8, 40, 'closed', 4, 26, 0, '2025-08-26 00:00:00', '2025-10-05 01:40:00'),
(133, 'RPT133', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 26 - ط¬ط±ط§ط¦ظ… ط§ظ„طھط²ظˆظٹط± - طھط²ظˆظٹط± ط´ظ‡ط§ط¯ط§طھ', 8, 41, 'prosse', 5, 27, 0, '2025-08-29 00:00:00', '2025-10-05 01:40:00'),
(134, 'RPT134', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 27 - ط¬ط±ط§ط¦ظ… ط§ظ„ط£ط³ظ„ط­ط© ط؛ظٹط± ط§ظ„ظ…ط±ط®طµط© - ط­ظٹط§ط²ط© ط£ط³ظ„ط­ط© ط؛ظٹط± ظ…ط±ط®طµط©', 9, 42, 'closed', 5, 28, 0, '2025-08-28 00:00:00', '2025-10-05 01:40:00'),
(135, 'RPT135', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 28 - ط¬ط±ط§ط¦ظ… ط§ظ„ط£ط³ظ„ط­ط© ط؛ظٹط± ط§ظ„ظ…ط±ط®طµط© - ط§طھط¬ط§ط± ط¨ط§ظ„ط£ط³ظ„ط­ط©', 9, 43, 'prosse', 5, 29, 0, '2025-07-08 00:00:00', '2025-10-05 01:40:00'),
(136, 'RPT136', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 29 - ط¬ط±ط§ط¦ظ… ط§ظ„ظپط³ط§ط¯ - ط±ط´ظˆط©', 10, 44, 'opened', 5, 30, 0, '2025-07-30 00:00:00', '2025-10-05 01:40:00'),
(137, 'RPT137', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 30 - ط¬ط±ط§ط¦ظ… ط§ظ„ظپط³ط§ط¯ - ط§ط®طھظ„ط§ط³ ط£ظ…ظˆط§ظ„ ط¹ط§ظ…ط©', 10, 45, 'prosse', 5, 31, 0, '2025-07-06 00:00:00', '2025-10-05 01:40:00'),
(138, 'RPT138', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 31 - ط¬ط±ط§ط¦ظ… ط§ظ„ظپط³ط§ط¯ - طھط²ظˆظٹط± ط¹ط·ط§ط،ط§طھ', 10, 46, 'prosse', 6, 32, 0, '2025-07-30 00:00:00', '2025-10-05 01:40:00'),
(139, 'RPT139', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 32 - ط¬ط±ط§ط¦ظ… ط§ظ„ط³ط±ظ‚ط© - ط³ط±ظ‚ط© ظ…ظ†ط§ط²ظ„', 1, 16, 'closed', 6, 33, 0, '2025-07-15 00:00:00', '2025-10-05 01:40:00'),
(140, 'RPT140', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 33 - ط¬ط±ط§ط¦ظ… ط§ظ„ط³ط±ظ‚ط© - ط³ط±ظ‚ط© ظ…ط­ظ„ط§طھ طھط¬ط§ط±ظٹط©', 1, 17, 'closed', 6, 34, 0, '2025-07-11 00:00:00', '2025-10-05 01:40:00'),
(141, 'RPT141', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 34 - ط¬ط±ط§ط¦ظ… ط§ظ„ط³ط±ظ‚ط© - ط³ط±ظ‚ط© ط³ظٹط§ط±ط§طھ', 1, 18, 'prosse', 6, 35, 0, '2025-07-25 00:00:00', '2025-10-05 01:40:00'),
(142, 'RPT142', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 35 - ط¬ط±ط§ط¦ظ… ط§ظ„ط³ط±ظ‚ط© - ط³ط±ظ‚ط© ظ…ط³ظ„ط­ط©', 1, 19, 'closed', 6, 36, 0, '2025-07-28 00:00:00', '2025-10-05 01:40:00'),
(143, 'RPT143', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 36 - ط¬ط±ط§ط¦ظ… ط§ظ„ط³ط±ظ‚ط© - ظ†ط´ظ„ ظˆط³ط±ظ‚ط© ظ…ط­ط§ظپط¸', 1, 20, 'prosse', 7, 37, 0, '2025-06-28 00:00:00', '2025-10-05 01:40:00'),
(144, 'RPT144', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 37 - ط§ظ„ط¥ط¹طھط¯ط§ط، - ط§ط¹طھط¯ط§ط، ط¨ط§ظ„ط³ظ„ط§ط­ ط§ظ„ط£ط¨ظٹط¶', 2, 21, 'closed', 7, 38, 0, '2025-06-26 00:00:00', '2025-10-05 01:40:00'),
(145, 'RPT145', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 38 - ط§ظ„ط¥ط¹طھط¯ط§ط، - ط§ط¹طھط¯ط§ط، ط¨ط§ظ„ط³ظ„ط§ط­ ط§ظ„ظ†ط§ط±ظٹ', 2, 22, 'closed', 7, 39, 0, '2025-06-02 00:00:00', '2025-10-05 01:40:00'),
(146, 'RPT146', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 39 - ط§ظ„ط¥ط¹طھط¯ط§ط، - ط§ط¹طھط¯ط§ط، ط¬ط³ط¯ظٹ ظ…ط¨ط±ط­', 2, 23, 'opened', 7, 40, 0, '2025-06-12 00:00:00', '2025-10-05 01:40:00'),
(147, 'RPT147', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 40 - ط§ظ„ط¥ط¹طھط¯ط§ط، - ط§ط¹طھط¯ط§ط، ط¬ظ†ط³ظٹ', 2, 24, 'closed', 7, 41, 0, '2025-06-12 00:00:00', '2025-10-05 01:40:00'),
(148, 'RPT148', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 41 - ط¬ط±ط§ط¦ظ… ط§ظ„ظ…ط®ط¯ط±ط§طھ - ط§طھط¬ط§ط± ط¨ط§ظ„ظ…ط®ط¯ط±ط§طھ', 3, 25, 'closed', 8, 42, 0, '2025-05-19 00:00:00', '2025-10-05 01:40:00'),
(149, 'RPT149', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 42 - ط¬ط±ط§ط¦ظ… ط§ظ„ظ…ط®ط¯ط±ط§طھ - طھظˆط²ظٹط¹ ظ…ط®ط¯ط±ط§طھ', 3, 26, 'prosse', 8, 43, 0, '2025-05-16 00:00:00', '2025-10-05 01:40:00'),
(150, 'RPT150', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 43 - ط¬ط±ط§ط¦ظ… ط§ظ„ظ…ط®ط¯ط±ط§طھ - ط­ظٹط§ط²ط© ظ…ط®ط¯ط±ط§طھ ط¨ظƒظ…ظٹط§طھ ظƒط¨ظٹط±ط©', 3, 27, 'opened', 8, 44, 0, '2025-05-27 00:00:00', '2025-10-05 01:40:00'),
(151, 'RPT151', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 44 - ط¬ط±ط§ط¦ظ… ط§ظ„ط§ط®طھط·ط§ظپ - ط§ط®طھط·ط§ظپ ط·ظپظ„', 4, 28, 'opened', 8, 45, 0, '2025-05-22 00:00:00', '2025-10-05 01:40:00'),
(152, 'RPT152', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 45 - ط¬ط±ط§ط¦ظ… ط§ظ„ط§ط®طھط·ط§ظپ - ط§ط®طھط·ط§ظپ ط¨ط§ظ„ط؛', 4, 29, 'prosse', 8, 46, 0, '2025-05-16 00:00:00', '2025-10-05 01:40:00'),
(153, 'RPT153', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 46 - ط¬ط±ط§ط¦ظ… ط§ظ„ط§ط®طھط·ط§ظپ - ط§ط®طھط·ط§ظپ ط·ظ„ط¨ ظپط¯ظٹط©', 4, 30, 'prosse', 9, 47, 0, '2025-05-26 00:00:00', '2025-10-05 01:40:00'),
(154, 'RPT154', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 47 - ط¬ط±ط§ط¦ظ… ط§ظ„طھظ‡ط¯ظٹط¯ ظˆط§ظ„ط§ط¨طھط²ط§ط² - طھظ‡ط¯ظٹط¯ ط¨ط§ظ„ظ‚طھظ„', 5, 31, 'opened', 9, 48, 0, '2025-04-25 00:00:00', '2025-10-05 01:40:00'),
(155, 'RPT155', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 48 - ط¬ط±ط§ط¦ظ… ط§ظ„طھظ‡ط¯ظٹط¯ ظˆط§ظ„ط§ط¨طھط²ط§ط² - ط§ط¨طھط²ط§ط² ط¥ظ„ظƒطھط±ظˆظ†ظٹ', 5, 32, 'closed', 9, 49, 0, '2025-05-25 00:00:00', '2025-10-05 01:40:00'),
(156, 'RPT156', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 49 - ط¬ط±ط§ط¦ظ… ط§ظ„طھظ‡ط¯ظٹط¯ ظˆط§ظ„ط§ط¨طھط²ط§ط² - ط§ط¨طھط²ط§ط² ظ…ط§ظ„ظٹ', 5, 33, 'closed', 9, 50, 0, '2025-04-29 00:00:00', '2025-10-05 01:40:00'),
(157, 'RPT157', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 2 ط³ظ†ظˆظٹ 50 - ط¬ط±ط§ط¦ظ… ط§ظ„ظ‚طھظ„ - ظ‚طھظ„ ط¹ظ…ط¯', 6, 34, 'closed', 9, 51, 0, '2025-05-25 00:00:00', '2025-10-05 01:40:00'),
(171, 'RPT171', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 1 - ط¬ط±ط§ط¦ظ… ط§ظ„ط³ط±ظ‚ط© - ط³ط±ظ‚ط© ظ…ظ†ط§ط²ظ„', 1, 16, 'closed', 1, 1, 0, '2025-10-09 00:00:00', '2025-10-05 01:40:00'),
(172, 'RPT172', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 2 - ط¬ط±ط§ط¦ظ… ط§ظ„ط³ط±ظ‚ط© - ط³ط±ظ‚ط© ظ…ط­ظ„ط§طھ طھط¬ط§ط±ظٹط©', 1, 17, 'closed', 1, 2, 0, '2025-10-02 00:00:00', '2025-10-05 01:40:00'),
(173, 'RPT173', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 3 - ط¬ط±ط§ط¦ظ… ط§ظ„ط³ط±ظ‚ط© - ط³ط±ظ‚ط© ط³ظٹط§ط±ط§طھ', 1, 18, 'prosse', 1, 3, 0, '2025-10-11 00:00:00', '2025-10-05 01:40:00'),
(174, 'RPT174', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 4 - ط¬ط±ط§ط¦ظ… ط§ظ„ط³ط±ظ‚ط© - ط³ط±ظ‚ط© ظ…ط³ظ„ط­ط©', 1, 19, 'prosse', 1, 4, 0, '2025-10-14 00:00:00', '2025-10-05 01:40:00'),
(175, 'RPT175', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 5 - ط¬ط±ط§ط¦ظ… ط§ظ„ط³ط±ظ‚ط© - ظ†ط´ظ„ ظˆط³ط±ظ‚ط© ظ…ط­ط§ظپط¸', 1, 20, 'closed', 1, 5, 0, '2025-10-11 00:00:00', '2025-10-05 01:40:00'),
(176, 'RPT176', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 6 - ط§ظ„ط¥ط¹طھط¯ط§ط، - ط§ط¹طھط¯ط§ط، ط¨ط§ظ„ط³ظ„ط§ط­ ط§ظ„ط£ط¨ظٹط¶', 2, 21, 'prosse', 1, 6, 0, '2025-10-25 00:00:00', '2025-10-05 01:40:00'),
(177, 'RPT177', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 7 - ط§ظ„ط¥ط¹طھط¯ط§ط، - ط§ط¹طھط¯ط§ط، ط¨ط§ظ„ط³ظ„ط§ط­ ط§ظ„ظ†ط§ط±ظٹ', 2, 22, 'prosse', 1, 7, 0, '2025-10-18 00:00:00', '2025-10-05 01:40:00'),
(178, 'RPT178', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 8 - ط§ظ„ط¥ط¹طھط¯ط§ط، - ط§ط¹طھط¯ط§ط، ط¬ط³ط¯ظٹ ظ…ط¨ط±ط­', 2, 23, 'closed', 1, 8, 0, '2025-10-26 00:00:00', '2025-10-05 01:40:00'),
(179, 'RPT179', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 9 - ط§ظ„ط¥ط¹طھط¯ط§ط، - ط§ط¹طھط¯ط§ط، ط¬ظ†ط³ظٹ', 2, 24, 'closed', 1, 9, 0, '2025-10-05 00:00:00', '2025-10-05 01:40:00'),
(180, 'RPT180', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 10 - ط¬ط±ط§ط¦ظ… ط§ظ„ظ…ط®ط¯ط±ط§طھ - ط§طھط¬ط§ط± ط¨ط§ظ„ظ…ط®ط¯ط±ط§طھ', 3, 25, 'prosse', 1, 10, 0, '2025-10-21 00:00:00', '2025-10-05 01:40:00'),
(181, 'RPT181', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 11 - ط¬ط±ط§ط¦ظ… ط§ظ„ظ…ط®ط¯ط±ط§طھ - طھظˆط²ظٹط¹ ظ…ط®ط¯ط±ط§طھ', 3, 26, 'opened', 1, 11, 0, '2025-10-23 00:00:00', '2025-10-05 01:40:00'),
(182, 'RPT182', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 12 - ط¬ط±ط§ط¦ظ… ط§ظ„ظ…ط®ط¯ط±ط§طھ - ط­ظٹط§ط²ط© ظ…ط®ط¯ط±ط§طھ ط¨ظƒظ…ظٹط§طھ ظƒط¨ظٹط±ط©', 3, 27, 'closed', 2, 12, 0, '2025-10-16 00:00:00', '2025-10-05 01:40:00'),
(183, 'RPT183', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 13 - ط¬ط±ط§ط¦ظ… ط§ظ„ط§ط®طھط·ط§ظپ - ط§ط®طھط·ط§ظپ ط·ظپظ„', 4, 28, 'closed', 2, 13, 0, '2025-10-23 00:00:00', '2025-10-05 01:40:00'),
(184, 'RPT184', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 14 - ط¬ط±ط§ط¦ظ… ط§ظ„ط§ط®طھط·ط§ظپ - ط§ط®طھط·ط§ظپ ط¨ط§ظ„ط؛', 4, 29, 'prosse', 2, 14, 0, '2025-10-16 00:00:00', '2025-10-05 01:40:00'),
(185, 'RPT185', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 15 - ط¬ط±ط§ط¦ظ… ط§ظ„ط§ط®طھط·ط§ظپ - ط§ط®طھط·ط§ظپ ط·ظ„ط¨ ظپط¯ظٹط©', 4, 30, 'closed', 2, 15, 0, '2025-10-29 00:00:00', '2025-10-05 01:40:00'),
(186, 'RPT186', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 16 - ط¬ط±ط§ط¦ظ… ط§ظ„طھظ‡ط¯ظٹط¯ ظˆط§ظ„ط§ط¨طھط²ط§ط² - طھظ‡ط¯ظٹط¯ ط¨ط§ظ„ظ‚طھظ„', 5, 31, 'closed', 2, 16, 0, '2025-09-17 00:00:00', '2025-10-05 01:40:00'),
(187, 'RPT187', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 17 - ط¬ط±ط§ط¦ظ… ط§ظ„طھظ‡ط¯ظٹط¯ ظˆط§ظ„ط§ط¨طھط²ط§ط² - ط§ط¨طھط²ط§ط² ط¥ظ„ظƒطھط±ظˆظ†ظٹ', 5, 32, 'closed', 3, 17, 0, '2025-09-29 00:00:00', '2025-10-05 01:40:00'),
(188, 'RPT188', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 18 - ط¬ط±ط§ط¦ظ… ط§ظ„طھظ‡ط¯ظٹط¯ ظˆط§ظ„ط§ط¨طھط²ط§ط² - ط§ط¨طھط²ط§ط² ظ…ط§ظ„ظٹ', 5, 33, 'closed', 3, 18, 0, '2025-09-28 00:00:00', '2025-10-05 01:40:00'),
(189, 'RPT189', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 19 - ط¬ط±ط§ط¦ظ… ط§ظ„ظ‚طھظ„ - ظ‚طھظ„ ط¹ظ…ط¯', 6, 34, 'prosse', 3, 19, 0, '2025-09-08 00:00:00', '2025-10-05 01:40:00'),
(190, 'RPT190', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 20 - ط¬ط±ط§ط¦ظ… ط§ظ„ظ‚طھظ„ - ظ‚طھظ„ ط®ط·ط£', 6, 35, 'closed', 3, 20, 0, '2025-09-17 00:00:00', '2025-10-05 01:40:00'),
(191, 'RPT191', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 21 - ط¬ط±ط§ط¦ظ… ط§ظ„ظ‚طھظ„ - ط´ط±ظˆط¹ ظ‚طھظ„', 6, 36, 'prosse', 3, 21, 0, '2025-09-08 00:00:00', '2025-10-05 01:40:00'),
(192, 'RPT192', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 22 - ط¬ط±ط§ط¦ظ… ط§ظ„ط­ط±ط§ط¦ظ‚ ط§ظ„ظ…طھط¹ظ…ط¯ط© - ط­ط±ظٹظ‚ ظ…طھط¹ظ…ط¯ ظ„ظ…ط¨ظ†ظ‰', 7, 37, 'closed', 4, 22, 0, '2025-09-06 00:00:00', '2025-10-05 01:40:00'),
(193, 'RPT193', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 23 - ط¬ط±ط§ط¦ظ… ط§ظ„ط­ط±ط§ط¦ظ‚ ط§ظ„ظ…طھط¹ظ…ط¯ط© - ط­ط±ظٹظ‚ ظ…طھط¹ظ…ط¯ ظ„ظ…ط±ظƒط¨ط©', 7, 38, 'closed', 4, 24, 0, '2025-09-15 00:00:00', '2025-10-05 01:40:00'),
(194, 'RPT194', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 24 - ط¬ط±ط§ط¦ظ… ط§ظ„طھط²ظˆظٹط± - طھط²ظˆظٹط± ظ…ط³طھظ†ط¯ط§طھ ط±ط³ظ…ظٹط©', 8, 39, 'opened', 4, 25, 0, '2025-09-22 00:00:00', '2025-10-05 01:40:00'),
(195, 'RPT195', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 25 - ط¬ط±ط§ط¦ظ… ط§ظ„طھط²ظˆظٹط± - طھط²ظˆظٹط± ط¹ظ…ظ„ط©', 8, 40, 'closed', 4, 26, 0, '2025-09-06 00:00:00', '2025-10-05 01:40:00'),
(196, 'RPT196', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 26 - ط¬ط±ط§ط¦ظ… ط§ظ„طھط²ظˆظٹط± - طھط²ظˆظٹط± ط´ظ‡ط§ط¯ط§طھ', 8, 41, 'prosse', 5, 27, 0, '2025-09-13 00:00:00', '2025-10-05 01:40:00'),
(197, 'RPT197', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 27 - ط¬ط±ط§ط¦ظ… ط§ظ„ط£ط³ظ„ط­ط© ط؛ظٹط± ط§ظ„ظ…ط±ط®طµط© - ط­ظٹط§ط²ط© ط£ط³ظ„ط­ط© ط؛ظٹط± ظ…ط±ط®طµط©', 9, 42, 'closed', 5, 28, 0, '2025-09-25 00:00:00', '2025-10-05 01:40:00'),
(198, 'RPT198', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 28 - ط¬ط±ط§ط¦ظ… ط§ظ„ط£ط³ظ„ط­ط© ط؛ظٹط± ط§ظ„ظ…ط±ط®طµط© - ط§طھط¬ط§ط± ط¨ط§ظ„ط£ط³ظ„ط­ط©', 9, 43, 'closed', 5, 29, 0, '2025-09-11 00:00:00', '2025-10-05 01:40:00'),
(199, 'RPT199', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 29 - ط¬ط±ط§ط¦ظ… ط§ظ„ظپط³ط§ط¯ - ط±ط´ظˆط©', 10, 44, 'closed', 5, 30, 0, '2025-09-17 00:00:00', '2025-10-05 01:40:00'),
(200, 'RPT200', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 30 - ط¬ط±ط§ط¦ظ… ط§ظ„ظپط³ط§ط¯ - ط§ط®طھظ„ط§ط³ ط£ظ…ظˆط§ظ„ ط¹ط§ظ…ط©', 10, 45, 'prosse', 5, 31, 0, '2025-09-19 00:00:00', '2025-10-05 01:40:00'),
(201, 'RPT201', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 31 - ط¬ط±ط§ط¦ظ… ط§ظ„ظپط³ط§ط¯ - طھط²ظˆظٹط± ط¹ط·ط§ط،ط§طھ', 10, 46, 'opened', 6, 32, 0, '2025-08-01 00:00:00', '2025-10-05 01:40:00'),
(202, 'RPT202', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 32 - ط¬ط±ط§ط¦ظ… ط§ظ„ط³ط±ظ‚ط© - ط³ط±ظ‚ط© ظ…ظ†ط§ط²ظ„', 1, 16, 'closed', 6, 33, 0, '2025-08-22 00:00:00', '2025-10-05 01:40:00'),
(203, 'RPT203', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 33 - ط¬ط±ط§ط¦ظ… ط§ظ„ط³ط±ظ‚ط© - ط³ط±ظ‚ط© ظ…ط­ظ„ط§طھ طھط¬ط§ط±ظٹط©', 1, 17, 'prosse', 6, 34, 0, '2025-08-08 00:00:00', '2025-10-05 01:40:00'),
(204, 'RPT204', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 34 - ط¬ط±ط§ط¦ظ… ط§ظ„ط³ط±ظ‚ط© - ط³ط±ظ‚ط© ط³ظٹط§ط±ط§طھ', 1, 18, 'closed', 6, 35, 0, '2025-08-03 00:00:00', '2025-10-05 01:40:00'),
(205, 'RPT205', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 35 - ط¬ط±ط§ط¦ظ… ط§ظ„ط³ط±ظ‚ط© - ط³ط±ظ‚ط© ظ…ط³ظ„ط­ط©', 1, 19, 'prosse', 6, 36, 0, '2025-08-29 00:00:00', '2025-10-05 01:40:00'),
(206, 'RPT206', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 36 - ط¬ط±ط§ط¦ظ… ط§ظ„ط³ط±ظ‚ط© - ظ†ط´ظ„ ظˆط³ط±ظ‚ط© ظ…ط­ط§ظپط¸', 1, 20, 'closed', 7, 37, 0, '2025-08-09 00:00:00', '2025-10-05 01:40:00'),
(207, 'RPT207', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 37 - ط§ظ„ط¥ط¹طھط¯ط§ط، - ط§ط¹طھط¯ط§ط، ط¨ط§ظ„ط³ظ„ط§ط­ ط§ظ„ط£ط¨ظٹط¶', 2, 21, 'closed', 7, 38, 0, '2025-08-11 00:00:00', '2025-10-05 01:40:00'),
(208, 'RPT208', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 38 - ط§ظ„ط¥ط¹طھط¯ط§ط، - ط§ط¹طھط¯ط§ط، ط¨ط§ظ„ط³ظ„ط§ط­ ط§ظ„ظ†ط§ط±ظٹ', 2, 22, 'opened', 7, 39, 0, '2025-08-31 00:00:00', '2025-10-05 01:40:00'),
(209, 'RPT209', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 39 - ط§ظ„ط¥ط¹طھط¯ط§ط، - ط§ط¹طھط¯ط§ط، ط¬ط³ط¯ظٹ ظ…ط¨ط±ط­', 2, 23, 'opened', 7, 40, 0, '2025-08-04 00:00:00', '2025-10-05 01:40:00'),
(210, 'RPT210', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 40 - ط§ظ„ط¥ط¹طھط¯ط§ط، - ط§ط¹طھط¯ط§ط، ط¬ظ†ط³ظٹ', 2, 24, 'closed', 7, 41, 0, '2025-08-02 00:00:00', '2025-10-05 01:40:00'),
(211, 'RPT211', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 41 - ط¬ط±ط§ط¦ظ… ط§ظ„ظ…ط®ط¯ط±ط§طھ - ط§طھط¬ط§ط± ط¨ط§ظ„ظ…ط®ط¯ط±ط§طھ', 3, 25, 'closed', 8, 42, 0, '2025-07-27 00:00:00', '2025-10-05 01:40:00'),
(212, 'RPT212', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 42 - ط¬ط±ط§ط¦ظ… ط§ظ„ظ…ط®ط¯ط±ط§طھ - طھظˆط²ظٹط¹ ظ…ط®ط¯ط±ط§طھ', 3, 26, 'closed', 8, 43, 0, '2025-07-14 00:00:00', '2025-10-05 01:40:00'),
(213, 'RPT213', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 43 - ط¬ط±ط§ط¦ظ… ط§ظ„ظ…ط®ط¯ط±ط§طھ - ط­ظٹط§ط²ط© ظ…ط®ط¯ط±ط§طھ ط¨ظƒظ…ظٹط§طھ ظƒط¨ظٹط±ط©', 3, 27, 'opened', 8, 44, 0, '2025-07-01 00:00:00', '2025-10-05 01:40:00'),
(214, 'RPT214', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 44 - ط¬ط±ط§ط¦ظ… ط§ظ„ط§ط®طھط·ط§ظپ - ط§ط®طھط·ط§ظپ ط·ظپظ„', 4, 28, 'closed', 8, 45, 0, '2025-07-04 00:00:00', '2025-10-05 01:40:00'),
(215, 'RPT215', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 45 - ط¬ط±ط§ط¦ظ… ط§ظ„ط§ط®طھط·ط§ظپ - ط§ط®طھط·ط§ظپ ط¨ط§ظ„ط؛', 4, 29, 'closed', 8, 46, 0, '2025-07-03 00:00:00', '2025-10-05 01:40:00'),
(216, 'RPT216', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 46 - ط¬ط±ط§ط¦ظ… ط§ظ„ط§ط®طھط·ط§ظپ - ط§ط®طھط·ط§ظپ ط·ظ„ط¨ ظپط¯ظٹط©', 4, 30, 'closed', 9, 47, 0, '2025-07-09 00:00:00', '2025-10-05 01:40:00'),
(217, 'RPT217', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 47 - ط¬ط±ط§ط¦ظ… ط§ظ„طھظ‡ط¯ظٹط¯ ظˆط§ظ„ط§ط¨طھط²ط§ط² - طھظ‡ط¯ظٹط¯ ط¨ط§ظ„ظ‚طھظ„', 5, 31, 'closed', 9, 48, 0, '2025-07-15 00:00:00', '2025-10-05 01:40:00'),
(218, 'RPT218', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 48 - ط¬ط±ط§ط¦ظ… ط§ظ„طھظ‡ط¯ظٹط¯ ظˆط§ظ„ط§ط¨طھط²ط§ط² - ط§ط¨طھط²ط§ط² ط¥ظ„ظƒطھط±ظˆظ†ظٹ', 5, 32, 'closed', 9, 49, 0, '2025-07-10 00:00:00', '2025-10-05 01:40:00'),
(219, 'RPT219', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 49 - ط¬ط±ط§ط¦ظ… ط§ظ„طھظ‡ط¯ظٹط¯ ظˆط§ظ„ط§ط¨طھط²ط§ط² - ط§ط¨طھط²ط§ط² ظ…ط§ظ„ظٹ', 5, 33, 'closed', 9, 50, 0, '2025-06-02 00:00:00', '2025-10-05 01:40:00'),
(220, 'RPT220', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 50 - ط¬ط±ط§ط¦ظ… ط§ظ„ظ‚طھظ„ - ظ‚طھظ„ ط¹ظ…ط¯', 6, 34, 'closed', 9, 51, 0, '2025-06-13 00:00:00', '2025-10-05 01:40:00'),
(221, 'RPT221', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 51 - ط¬ط±ط§ط¦ظ… ط§ظ„ظ‚طھظ„ - ظ‚طھظ„ ط®ط·ط£', 6, 35, 'closed', 10, 52, 0, '2025-06-23 00:00:00', '2025-10-05 01:40:00'),
(222, 'RPT222', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 52 - ط¬ط±ط§ط¦ظ… ط§ظ„ظ‚طھظ„ - ط´ط±ظˆط¹ ظ‚طھظ„', 6, 36, 'closed', 10, 53, 0, '2025-06-09 00:00:00', '2025-10-05 01:40:00'),
(223, 'RPT223', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 53 - ط¬ط±ط§ط¦ظ… ط§ظ„ط­ط±ط§ط¦ظ‚ ط§ظ„ظ…طھط¹ظ…ط¯ط© - ط­ط±ظٹظ‚ ظ…طھط¹ظ…ط¯ ظ„ظ…ط¨ظ†ظ‰', 7, 37, 'opened', 10, 54, 0, '2025-06-08 00:00:00', '2025-10-05 01:40:00'),
(224, 'RPT224', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 54 - ط¬ط±ط§ط¦ظ… ط§ظ„ط­ط±ط§ط¦ظ‚ ط§ظ„ظ…طھط¹ظ…ط¯ط© - ط­ط±ظٹظ‚ ظ…طھط¹ظ…ط¯ ظ„ظ…ط±ظƒط¨ط©', 7, 38, 'closed', 10, 55, 0, '2025-06-29 00:00:00', '2025-10-05 01:40:00'),
(225, 'RPT225', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 55 - ط¬ط±ط§ط¦ظ… ط§ظ„طھط²ظˆظٹط± - طھط²ظˆظٹط± ظ…ط³طھظ†ط¯ط§طھ ط±ط³ظ…ظٹط©', 8, 39, 'prosse', 10, 56, 0, '2025-05-08 00:00:00', '2025-10-05 01:40:00'),
(226, 'RPT226', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 56 - ط¬ط±ط§ط¦ظ… ط§ظ„طھط²ظˆظٹط± - طھط²ظˆظٹط± ط¹ظ…ظ„ط©', 8, 40, 'prosse', 11, 57, 0, '2025-05-25 00:00:00', '2025-10-05 01:40:00'),
(227, 'RPT227', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 57 - ط¬ط±ط§ط¦ظ… ط§ظ„طھط²ظˆظٹط± - طھط²ظˆظٹط± ط´ظ‡ط§ط¯ط§طھ', 8, 41, 'closed', 11, 58, 0, '2025-05-31 00:00:00', '2025-10-05 01:40:00'),
(228, 'RPT228', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 58 - ط¬ط±ط§ط¦ظ… ط§ظ„ط£ط³ظ„ط­ط© ط؛ظٹط± ط§ظ„ظ…ط±ط®طµط© - ط­ظٹط§ط²ط© ط£ط³ظ„ط­ط© ط؛ظٹط± ظ…ط±ط®طµط©', 9, 42, 'prosse', 11, 59, 0, '2025-05-07 00:00:00', '2025-10-05 01:40:00'),
(229, 'RPT229', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 59 - ط¬ط±ط§ط¦ظ… ط§ظ„ط£ط³ظ„ط­ط© ط؛ظٹط± ط§ظ„ظ…ط±ط®طµط© - ط§طھط¬ط§ط± ط¨ط§ظ„ط£ط³ظ„ط­ط©', 9, 43, 'prosse', 11, 60, 0, '2025-04-07 00:00:00', '2025-10-05 01:40:00'),
(230, 'RPT230', 'ط¨ظ„ط§ط؛ ظ‚ط³ظ… 3 ط³ظ†ظˆظٹ 60 - ط¬ط±ط§ط¦ظ… ط§ظ„ظپط³ط§ط¯ - ط±ط´ظˆط©', 10, 44, 'closed', 11, 61, 0, '2025-04-04 00:00:00', '2025-10-05 01:40:00'),
(231, 'RPT-20251005-171445-826', 'Jzjsjsjsjs', 3, 25, 'opened', 1, 1, 0, '2025-10-05 20:14:46', '2025-10-05 20:14:46'),
(237, 'RPT-20251005-175441-657', 'Vbhbzhhsjshjs', 4, 29, 'opened', 6, 34, 0, '2025-10-05 20:54:41', '2025-10-05 20:54:41'),
(238, 'RPT-20251005-175739-901', 'Vbhbzhhsjshjs', 4, 29, 'opened', 6, 34, 0, '2025-10-05 20:57:39', '2025-10-05 20:57:39'),
(239, 'RPT-20251005-175852-978', 'Vbhbzhhsjshjs', 4, 29, 'opened', 6, 34, 0, '2025-10-05 20:58:52', '2025-10-05 20:58:52'),
(240, 'RPT-20251006-183302-752', 'Bhhhhhhhhhhhhh', 1, 16, 'opened', 2, 13, 0, '2025-10-06 21:33:02', '2025-10-06 21:33:02'),
(241, 'RPT-20251006-183325-629', 'Bhhhhhhhhhhhhh', 1, 16, 'opened', 2, 13, 0, '2025-10-06 21:33:25', '2025-10-06 21:33:25'),
(242, 'RPT-20251006-183428-416', 'Bhhhhhhhhhhhhh', 1, 16, 'opened', 2, 13, 0, '2025-10-06 21:34:28', '2025-10-06 21:34:28'),
(243, 'RPT-20251006-183537-109', 'Bhhhhhhhhhhhhh', 1, 16, 'opened', 2, 13, 0, '2025-10-06 21:35:37', '2025-10-06 21:35:37'),
(244, 'RPT-20251006-183651-956', 'Bhhhhhhhhhhhhh', 1, 16, 'opened', 2, 13, 0, '2025-10-06 21:36:51', '2025-10-06 21:36:51'),
(245, 'RPT-20251006-183852-899', 'Bhhhhhhhhhhhhh', 1, 16, 'opened', 2, 13, 0, '2025-10-06 21:38:52', '2025-10-06 21:38:52'),
(246, 'RPT-20251006-183858-132', 'Bhhhhhhhhhhhhh', 1, 16, 'opened', 2, 13, 0, '2025-10-06 21:38:58', '2025-10-06 21:38:58'),
(247, 'RPT-20251006-183908-983', 'Bhhhhhhhhhhhhh', 1, 16, 'opened', 2, 13, 0, '2025-10-06 21:39:08', '2025-10-06 21:39:08'),
(248, 'RPT-20251006-183913-674', 'Bhhhhhhhhhhhhh', 1, 16, 'opened', 2, 13, 0, '2025-10-06 21:39:13', '2025-10-06 21:39:13'),
(249, 'RPT-20251006-183918-928', 'Bhhhhhhhhhhhhh', 1, 16, 'opened', 2, 13, 0, '2025-10-06 21:39:18', '2025-10-06 21:39:18'),
(250, 'RPT-20251006-183931-564', 'Bhhhhhhhhhhhhh', 1, 16, 'opened', 2, 13, 0, '2025-10-06 21:39:31', '2025-10-06 21:39:31'),
(251, 'RPT-20251006-183935-963', 'Bhhhhhhhhhhhhh', 1, 16, 'opened', 2, 13, 0, '2025-10-06 21:39:35', '2025-10-06 21:39:35'),
(252, 'RPT-20251006-184019-117', 'Bhhhhhhhhhhhhh', 1, 16, 'opened', 2, 13, 0, '2025-10-06 21:40:19', '2025-10-06 21:40:19'),
(253, 'RPT-20251006-184033-379', 'Bhhhhhhhhhhhhh', 1, 16, 'opened', 2, 13, 0, '2025-10-06 21:40:33', '2025-10-06 21:40:33'),
(254, 'RPT-20251006-184122-900', 'Bhhhhhhhhhhhhh', 1, 16, 'opened', 2, 13, 0, '2025-10-06 21:41:22', '2025-10-06 21:41:22'),
(255, 'RPT-20251006-184143-471', 'Bhhhhhhhhhhhhh', 1, 16, 'opened', 2, 13, 0, '2025-10-06 21:41:43', '2025-10-06 21:41:43'),
(256, 'RPT-20251006-184212-568', 'Bhhhhhhhhhhhhh', 1, 16, 'opened', 2, 13, 0, '2025-10-06 21:42:12', '2025-10-06 21:42:12'),
(257, 'RPT-20251006-184320-357', 'Bhhhhhhhhhhhhh', 1, 16, 'opened', 2, 13, 0, '2025-10-06 21:43:20', '2025-10-06 21:43:20'),
(258, 'RPT-20251006-184326-209', 'Bhhhhhhhhhhhhh', 1, 16, 'opened', 2, 13, 0, '2025-10-06 21:43:26', '2025-10-06 21:43:26'),
(259, 'RPT-20251006-184608-863', 'Bhhhhhhhhhhhhh', 1, 16, 'opened', 2, 13, 0, '2025-10-06 21:46:08', '2025-10-06 21:46:08'),
(260, 'RPT-20251006-184617-398', 'Bhhhhhhhhhhhhh', 1, 16, 'opened', 2, 13, 0, '2025-10-06 21:46:17', '2025-10-06 21:46:17'),
(261, 'RPT-20251006-184740-401', 'Bhhhhhhhhhhhhh', 1, 16, 'opened', 2, 13, 0, '2025-10-06 21:47:40', '2025-10-06 21:47:40'),
(262, 'RPT-20251006-190340-359', 'Bhhhhhhhhhhhhh', 1, 16, 'opened', 2, 13, 0, '2025-10-06 22:03:40', '2025-10-06 22:03:40'),
(263, 'RPT-20251006-190403-183', 'Bhhhhhhhhhhhhh', 1, 16, 'opened', 2, 13, 0, '2025-10-06 22:04:03', '2025-10-06 22:04:03'),
(264, 'RPT-20251006-190421-508', 'Bhhhhhhhhhhhhh', 1, 16, 'opened', 2, 13, 0, '2025-10-06 22:04:21', '2025-10-06 22:04:21'),
(265, 'RPT-20251006-190839-878', 'Bhhhhhhhhhhhhh', 1, 16, 'opened', 2, 13, 0, '2025-10-06 22:08:39', '2025-10-06 22:08:39'),
(266, 'RPT-20251006-190844-448', 'Bhhhhhhhhhhhhh', 1, 16, 'opened', 2, 13, 0, '2025-10-06 22:08:44', '2025-10-06 22:08:44'),
(267, 'RPT-20251006-192259-420', 'ط³ط§ط±ظ‚ najannJJa', 3, 25, 'opened', 1, 1, 0, '2025-10-06 22:22:59', '2025-10-06 22:22:59'),
(268, 'RPT-20251006-192723-394', 'ط³ط§ط±ظ‚ najannJJa', 3, 25, 'opened', 1, 1, 0, '2025-10-06 22:27:23', '2025-10-06 22:27:23'),
(269, 'RPT-20251006-193148-525', 'ط³ط§ط±ظ‚ najannJJa', 3, 25, 'opened', 1, 1, 0, '2025-10-06 22:31:48', '2025-10-06 22:31:48'),
(270, 'RPT-20251006-193513-321', 'ط³ط§ط±ظ‚ najannJJa', 3, 25, 'opened', 1, 1, 0, '2025-10-06 22:35:13', '2025-10-06 22:35:13'),
(271, 'RPT-20251006-193531-848', 'ط³ط§ط±ظ‚ najannJJa', 3, 25, 'opened', 1, 1, 0, '2025-10-06 22:35:31', '2025-10-06 22:35:31'),
(272, 'RPT-20251006-193744-215', 'ط³ط§ط±ظ‚ najannJJa', 3, 25, 'opened', 1, 1, 0, '2025-10-06 22:37:44', '2025-10-06 22:37:44'),
(273, 'RPT-20251006-193752-770', 'ط³ط§ط±ظ‚ najannJJa', 3, 25, 'opened', 1, 1, 0, '2025-10-06 22:37:52', '2025-10-06 22:37:52'),
(274, 'RPT-20251006-194327-953', 'ط³ط§ط±ظ‚ najannJJa', 3, 25, 'opened', 1, 1, 0, '2025-10-06 22:43:27', '2025-10-06 22:43:27'),
(275, 'RPT-20251006-194333-431', 'ط³ط§ط±ظ‚ najannJJa', 3, 25, 'opened', 1, 1, 0, '2025-10-06 22:43:33', '2025-10-06 22:43:33'),
(276, 'RPT-20251006-195017-598', 'ط³ط§ط±ظ‚ najannJJa', 3, 25, 'opened', 1, 1, 0, '2025-10-06 22:50:17', '2025-10-06 22:50:17'),
(277, 'RPT-20251006-213017-812', 'طھط±ظ†ظٹظ†ظ†ظٹظ†ظٹظ†ط«ظ†ظٹطھ', 1, 16, 'opened', 1, 1, 0, '2025-10-07 00:30:17', '2025-10-07 00:30:17');

-- --------------------------------------------------------

--
-- ط¨ظ†ظٹط© ط§ظ„ط¬ط¯ظˆظ„ `report_department`
--

CREATE TABLE `report_department` (
  `report_id` int(11) NOT NULL,
  `department_id` int(11) NOT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- ط¥ط±ط¬ط§ط¹ ط£ظˆ ط§ط³طھظٹط±ط§ط¯ ط¨ظٹط§ظ†ط§طھ ط§ظ„ط¬ط¯ظˆظ„ `report_department`
--

INSERT INTO `report_department` (`report_id`, `department_id`, `created_at`) VALUES
(1, 1, '2025-09-01 22:54:57'),
(1, 2, '2025-09-01 22:55:24'),
(6, 1, '2025-09-01 22:55:24'),
(6, 2, '2025-09-01 22:55:36'),
(49, 1, '2025-09-03 16:13:54'),
(50, 1, '2025-09-03 16:14:00'),
(57, 1, '2025-09-13 17:58:47'),
(58, 1, '2025-09-13 17:58:57'),
(59, 1, '2025-09-13 17:59:39'),
(60, 1, '2025-09-13 18:39:28'),
(61, 1, '2025-09-14 04:47:25'),
(62, 1, '2025-09-20 20:33:48'),
(63, 1, '2025-09-29 20:26:42'),
(65, 1, '2025-10-01 18:08:27'),
(66, 1, '2025-10-03 12:41:57'),
(67, 1, '2025-10-03 15:19:28'),
(68, 1, '2025-10-03 20:57:02'),
(70, 1, '2025-10-03 21:07:24'),
(71, 1, '2025-10-03 21:07:24'),
(72, 1, '2025-10-03 21:07:24'),
(73, 1, '2025-10-03 21:07:24'),
(74, 1, '2025-10-03 21:07:24'),
(75, 1, '2025-10-03 21:07:24'),
(76, 1, '2025-10-03 21:07:24'),
(77, 1, '2025-10-03 21:07:24'),
(78, 1, '2025-10-03 21:07:24'),
(79, 1, '2025-10-03 21:07:24'),
(80, 1, '2025-10-03 21:07:24'),
(81, 1, '2025-10-03 21:07:24'),
(82, 1, '2025-10-03 21:07:24'),
(83, 1, '2025-10-03 21:07:24'),
(84, 1, '2025-10-03 21:07:24'),
(85, 1, '2025-10-03 21:07:24'),
(86, 1, '2025-10-03 21:07:24'),
(87, 1, '2025-10-03 21:07:24'),
(88, 1, '2025-10-03 21:07:24'),
(89, 1, '2025-10-03 21:07:24'),
(108, 2, '2025-10-03 22:22:37'),
(109, 2, '2025-10-03 22:22:37'),
(110, 2, '2025-10-03 22:22:37'),
(111, 2, '2025-10-03 22:22:37'),
(112, 2, '2025-10-03 22:22:37'),
(113, 2, '2025-10-03 22:22:37'),
(114, 2, '2025-10-03 22:22:37'),
(115, 2, '2025-10-03 22:22:37'),
(116, 2, '2025-10-03 22:22:37'),
(117, 2, '2025-10-03 22:22:37'),
(118, 2, '2025-10-03 22:22:37'),
(119, 2, '2025-10-03 22:22:37'),
(120, 2, '2025-10-03 22:22:37'),
(121, 2, '2025-10-03 22:22:37'),
(122, 2, '2025-10-03 22:22:37'),
(123, 2, '2025-10-03 22:22:37'),
(124, 2, '2025-10-03 22:22:37'),
(125, 2, '2025-10-03 22:22:37'),
(126, 2, '2025-10-03 22:22:37'),
(127, 2, '2025-10-03 22:22:37'),
(128, 2, '2025-10-03 22:22:37'),
(129, 2, '2025-10-03 22:22:37'),
(130, 2, '2025-10-03 22:22:37'),
(131, 2, '2025-10-03 22:22:37'),
(132, 2, '2025-10-03 22:22:37'),
(133, 2, '2025-10-03 22:22:37'),
(134, 2, '2025-10-03 22:22:37'),
(135, 2, '2025-10-03 22:22:37'),
(136, 2, '2025-10-03 22:22:37'),
(137, 2, '2025-10-03 22:22:37'),
(138, 2, '2025-10-03 22:22:37'),
(139, 2, '2025-10-03 22:22:37'),
(140, 2, '2025-10-03 22:22:37'),
(141, 2, '2025-10-03 22:22:37'),
(142, 2, '2025-10-03 22:22:37'),
(143, 2, '2025-10-03 22:22:37'),
(144, 2, '2025-10-03 22:22:37'),
(145, 2, '2025-10-03 22:22:37'),
(146, 2, '2025-10-03 22:22:37'),
(147, 2, '2025-10-03 22:22:37'),
(148, 2, '2025-10-03 22:22:37'),
(149, 2, '2025-10-03 22:22:37'),
(150, 2, '2025-10-03 22:22:37'),
(151, 2, '2025-10-03 22:22:37'),
(152, 2, '2025-10-03 22:22:37'),
(153, 2, '2025-10-03 22:22:37'),
(154, 2, '2025-10-03 22:22:37'),
(155, 2, '2025-10-03 22:22:37'),
(156, 2, '2025-10-03 22:22:37'),
(157, 2, '2025-10-03 22:22:37'),
(171, 3, '2025-10-03 22:25:23'),
(172, 3, '2025-10-03 22:25:23'),
(173, 3, '2025-10-03 22:25:23'),
(174, 3, '2025-10-03 22:25:23'),
(175, 3, '2025-10-03 22:25:23'),
(176, 3, '2025-10-03 22:25:23'),
(177, 3, '2025-10-03 22:25:23'),
(178, 3, '2025-10-03 22:25:23'),
(179, 3, '2025-10-03 22:25:23'),
(180, 3, '2025-10-03 22:25:23'),
(181, 3, '2025-10-03 22:25:23'),
(182, 3, '2025-10-03 22:25:23'),
(183, 3, '2025-10-03 22:25:23'),
(184, 3, '2025-10-03 22:25:23'),
(185, 3, '2025-10-03 22:25:23'),
(186, 3, '2025-10-03 22:25:23'),
(187, 3, '2025-10-03 22:25:23'),
(188, 3, '2025-10-03 22:25:23'),
(189, 3, '2025-10-03 22:25:23'),
(190, 3, '2025-10-03 22:25:23'),
(191, 3, '2025-10-03 22:25:23'),
(192, 3, '2025-10-03 22:25:23'),
(193, 3, '2025-10-03 22:25:23'),
(194, 3, '2025-10-03 22:25:23'),
(195, 3, '2025-10-03 22:25:23'),
(196, 3, '2025-10-03 22:25:23'),
(197, 3, '2025-10-03 22:25:23'),
(198, 3, '2025-10-03 22:25:23'),
(199, 3, '2025-10-03 22:25:23'),
(200, 3, '2025-10-03 22:25:23'),
(201, 3, '2025-10-03 22:25:23'),
(202, 3, '2025-10-03 22:25:23'),
(203, 3, '2025-10-03 22:25:23'),
(204, 3, '2025-10-03 22:25:23'),
(205, 3, '2025-10-03 22:25:23'),
(206, 3, '2025-10-03 22:25:23'),
(207, 3, '2025-10-03 22:25:23'),
(208, 3, '2025-10-03 22:25:23'),
(209, 3, '2025-10-03 22:25:23'),
(210, 3, '2025-10-03 22:25:23'),
(211, 3, '2025-10-03 22:25:23'),
(212, 3, '2025-10-03 22:25:23'),
(213, 3, '2025-10-03 22:25:23'),
(214, 3, '2025-10-03 22:25:23'),
(215, 3, '2025-10-03 22:25:23'),
(216, 3, '2025-10-03 22:25:23'),
(217, 3, '2025-10-03 22:25:23'),
(218, 3, '2025-10-03 22:25:23'),
(219, 3, '2025-10-03 22:25:23'),
(220, 3, '2025-10-03 22:25:23'),
(221, 3, '2025-10-03 22:25:23'),
(222, 3, '2025-10-03 22:25:23'),
(223, 3, '2025-10-03 22:25:23'),
(224, 3, '2025-10-03 22:25:23'),
(225, 3, '2025-10-03 22:25:23'),
(226, 3, '2025-10-03 22:25:23'),
(227, 3, '2025-10-03 22:25:23'),
(228, 3, '2025-10-03 22:25:23'),
(229, 3, '2025-10-03 22:25:23'),
(230, 3, '2025-10-03 22:25:23'),
(231, 1, '2025-10-05 17:14:46'),
(237, 1, '2025-10-05 17:54:41'),
(238, 1, '2025-10-05 17:57:39'),
(239, 1, '2025-10-05 17:58:52'),
(240, 1, '2025-10-06 18:33:02'),
(241, 1, '2025-10-06 18:33:25'),
(242, 1, '2025-10-06 18:34:28'),
(243, 1, '2025-10-06 18:35:37'),
(244, 1, '2025-10-06 18:36:51'),
(245, 1, '2025-10-06 18:38:52'),
(246, 1, '2025-10-06 18:38:58'),
(247, 1, '2025-10-06 18:39:08'),
(248, 1, '2025-10-06 18:39:13'),
(249, 1, '2025-10-06 18:39:18'),
(250, 1, '2025-10-06 18:39:31'),
(251, 1, '2025-10-06 18:39:35'),
(252, 1, '2025-10-06 18:40:19'),
(253, 1, '2025-10-06 18:40:34'),
(254, 1, '2025-10-06 18:41:22'),
(255, 1, '2025-10-06 18:41:43'),
(256, 1, '2025-10-06 18:42:12'),
(257, 1, '2025-10-06 18:43:20'),
(258, 1, '2025-10-06 18:43:26'),
(259, 1, '2025-10-06 18:46:08'),
(260, 1, '2025-10-06 18:46:17'),
(261, 1, '2025-10-06 18:47:40'),
(262, 1, '2025-10-06 19:03:40'),
(263, 1, '2025-10-06 19:04:03'),
(264, 1, '2025-10-06 19:04:21'),
(265, 1, '2025-10-06 19:08:39'),
(266, 1, '2025-10-06 19:08:44'),
(267, 1, '2025-10-06 19:22:59'),
(268, 1, '2025-10-06 19:27:23'),
(269, 1, '2025-10-06 19:31:48'),
(270, 1, '2025-10-06 19:35:13'),
(271, 1, '2025-10-06 19:35:31'),
(272, 1, '2025-10-06 19:37:44'),
(273, 1, '2025-10-06 19:37:52'),
(274, 1, '2025-10-06 19:43:27'),
(275, 1, '2025-10-06 19:43:33'),
(276, 1, '2025-10-06 19:50:17'),
(277, 1, '2025-10-06 21:30:17');

-- --------------------------------------------------------

--
-- ط¨ظ†ظٹط© ط§ظ„ط¬ط¯ظˆظ„ `report_main_types`
--

CREATE TABLE `report_main_types` (
  `id` int(11) UNSIGNED NOT NULL,
  `type_name` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- ط¥ط±ط¬ط§ط¹ ط£ظˆ ط§ط³طھظٹط±ط§ط¯ ط¨ظٹط§ظ†ط§طھ ط§ظ„ط¬ط¯ظˆظ„ `report_main_types`
--

INSERT INTO `report_main_types` (`id`, `type_name`) VALUES
(1, 'ط¬ط±ط§ط¦ظ… ط§ظ„ط³ط±ظ‚ط©'),
(2, 'ط§ظ„ط¥ط¹طھط¯ط§ط،'),
(3, 'ط¬ط±ط§ط¦ظ… ط§ظ„ظ…ط®ط¯ط±ط§طھ'),
(4, 'ط¬ط±ط§ط¦ظ… ط§ظ„ط§ط®طھط·ط§ظپ'),
(5, 'ط¬ط±ط§ط¦ظ… ط§ظ„طھظ‡ط¯ظٹط¯ ظˆط§ظ„ط§ط¨طھط²ط§ط²'),
(6, 'ط¬ط±ط§ط¦ظ… ط§ظ„ظ‚طھظ„'),
(7, 'ط¬ط±ط§ط¦ظ… ط§ظ„ط­ط±ط§ط¦ظ‚ ط§ظ„ظ…طھط¹ظ…ط¯ط©'),
(8, 'ط¬ط±ط§ط¦ظ… ط§ظ„طھط²ظˆظٹط±'),
(9, 'ط¬ط±ط§ط¦ظ… ط§ظ„ط£ط³ظ„ط­ط© ط؛ظٹط± ط§ظ„ظ…ط±ط®طµط©'),
(10, 'ط¬ط±ط§ط¦ظ… ط§ظ„ظپط³ط§ط¯'),
(11, 'ط¬ط±ط§ط¦ظ… ط§ظٹطھط²ط§ط²');

-- --------------------------------------------------------

--
-- ط¨ظ†ظٹط© ط§ظ„ط¬ط¯ظˆظ„ `report_reporter`
--

CREATE TABLE `report_reporter` (
  `report_id` int(11) NOT NULL,
  `reporter_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- ط¥ط±ط¬ط§ط¹ ط£ظˆ ط§ط³طھظٹط±ط§ط¯ ط¨ظٹط§ظ†ط§طھ ط§ظ„ط¬ط¯ظˆظ„ `report_reporter`
--

INSERT INTO `report_reporter` (`report_id`, `reporter_id`) VALUES
(1, 1),
(49, 77),
(50, 78),
(57, 79),
(58, 80),
(59, 81),
(60, 82),
(61, 83),
(62, 84),
(63, 85),
(65, 86),
(66, 87),
(67, 88),
(68, 89),
(231, 90),
(237, 96),
(238, 97),
(239, 98),
(49, 79),
(49, 79),
(240, 99),
(241, 100),
(242, 101),
(243, 102),
(244, 103),
(245, 104),
(246, 105),
(247, 106),
(248, 107),
(249, 108),
(250, 109),
(251, 110),
(252, 111),
(253, 112),
(254, 113),
(255, 114),
(256, 115),
(257, 116),
(258, 117),
(259, 118),
(260, 119),
(261, 120),
(262, 121),
(263, 122),
(264, 123),
(265, 124),
(266, 125),
(276, 126),
(277, 127);

-- --------------------------------------------------------

--
-- ط¨ظ†ظٹط© ط§ظ„ط¬ط¯ظˆظ„ `report_sub_types`
--

CREATE TABLE `report_sub_types` (
  `id` int(6) UNSIGNED NOT NULL,
  `main_type_id` int(6) UNSIGNED NOT NULL,
  `sub_type_name` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- ط¥ط±ط¬ط§ط¹ ط£ظˆ ط§ط³طھظٹط±ط§ط¯ ط¨ظٹط§ظ†ط§طھ ط§ظ„ط¬ط¯ظˆظ„ `report_sub_types`
--

INSERT INTO `report_sub_types` (`id`, `main_type_id`, `sub_type_name`) VALUES
(16, 1, 'ط³ط±ظ‚ط© ظ…ظ†ط§ط²ظ„'),
(17, 1, 'ط³ط±ظ‚ط© ظ…ط­ظ„ط§طھ طھط¬ط§ط±ظٹط©'),
(18, 1, 'ط³ط±ظ‚ط© ط³ظٹط§ط±ط§طھ'),
(19, 1, 'ط³ط±ظ‚ط© ظ…ط³ظ„ط­ط©'),
(20, 1, 'ظ†ط´ظ„ ظˆط³ط±ظ‚ط© ظ…ط­ط§ظپط¸'),
(21, 2, 'ط§ط¹طھط¯ط§ط، ط¨ط§ظ„ط³ظ„ط§ط­ ط§ظ„ط£ط¨ظٹط¶'),
(22, 2, 'ط§ط¹طھط¯ط§ط، ط¨ط§ظ„ط³ظ„ط§ط­ ط§ظ„ظ†ط§ط±ظٹ'),
(23, 2, 'ط§ط¹طھط¯ط§ط، ط¬ط³ط¯ظٹ ظ…ط¨ط±ط­'),
(24, 2, 'ط§ط¹طھط¯ط§ط، ط¬ظ†ط³ظٹ'),
(25, 3, 'ط§طھط¬ط§ط± ط¨ط§ظ„ظ…ط®ط¯ط±ط§طھ'),
(26, 3, 'طھظˆط²ظٹط¹ ظ…ط®ط¯ط±ط§طھ'),
(27, 3, 'ط­ظٹط§ط²ط© ظ…ط®ط¯ط±ط§طھ ط¨ظƒظ…ظٹط§طھ ظƒط¨ظٹط±ط©'),
(28, 4, 'ط§ط®طھط·ط§ظپ ط·ظپظ„'),
(29, 4, 'ط§ط®طھط·ط§ظپ ط¨ط§ظ„ط؛'),
(30, 4, 'ط§ط®طھط·ط§ظپ ط·ظ„ط¨ ظپط¯ظٹط©'),
(31, 5, 'طھظ‡ط¯ظٹط¯ ط¨ط§ظ„ظ‚طھظ„'),
(32, 5, 'ط§ط¨طھط²ط§ط² ط¥ظ„ظƒطھط±ظˆظ†ظٹ'),
(33, 5, 'ط§ط¨طھط²ط§ط² ظ…ط§ظ„ظٹ'),
(34, 6, 'ظ‚طھظ„ ط¹ظ…ط¯'),
(35, 6, 'ظ‚طھظ„ ط®ط·ط£'),
(36, 6, 'ط´ط±ظˆط¹ ظ‚طھظ„'),
(37, 7, 'ط­ط±ظٹظ‚ ظ…طھط¹ظ…ط¯ ظ„ظ…ط¨ظ†ظ‰'),
(38, 7, 'ط­ط±ظٹظ‚ ظ…طھط¹ظ…ط¯ ظ„ظ…ط±ظƒط¨ط©'),
(39, 8, 'طھط²ظˆظٹط± ظ…ط³طھظ†ط¯ط§طھ ط±ط³ظ…ظٹط©'),
(40, 8, 'طھط²ظˆظٹط± ط¹ظ…ظ„ط©'),
(41, 8, 'طھط²ظˆظٹط± ط´ظ‡ط§ط¯ط§طھ'),
(42, 9, 'ط­ظٹط§ط²ط© ط£ط³ظ„ط­ط© ط؛ظٹط± ظ…ط±ط®طµط©'),
(43, 9, 'ط§طھط¬ط§ط± ط¨ط§ظ„ط£ط³ظ„ط­ط©'),
(44, 10, 'ط±ط´ظˆط©'),
(45, 10, 'ط§ط®طھظ„ط§ط³ ط£ظ…ظˆط§ظ„ ط¹ط§ظ…ط©'),
(46, 10, 'طھط²ظˆظٹط± ط¹ط·ط§ط،ط§طھ');

-- --------------------------------------------------------

--
-- ط¨ظ†ظٹط© ط§ظ„ط¬ط¯ظˆظ„ `report_suspect`
--

CREATE TABLE `report_suspect` (
  `report_id` int(11) NOT NULL,
  `suspect_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- ط¥ط±ط¬ط§ط¹ ط£ظˆ ط§ط³طھظٹط±ط§ط¯ ط¨ظٹط§ظ†ط§طھ ط§ظ„ط¬ط¯ظˆظ„ `report_suspect`
--

INSERT INTO `report_suspect` (`report_id`, `suspect_id`) VALUES
(49, 31),
(50, 32),
(57, 33),
(58, 34),
(59, 35),
(60, 36),
(61, 37),
(62, 38),
(63, 39),
(65, 40),
(66, 41),
(67, 42),
(68, 43),
(231, 44),
(237, 48),
(238, 49),
(239, 50),
(49, 40),
(240, 51),
(241, 52),
(242, 53),
(243, 54),
(244, 55),
(245, 56),
(246, 57),
(247, 58),
(248, 59),
(249, 60),
(250, 61),
(251, 62),
(252, 63),
(253, 64),
(254, 65),
(255, 66),
(256, 67),
(257, 68),
(258, 69),
(259, 70),
(260, 71),
(261, 72),
(262, 73),
(263, 74),
(264, 75),
(265, 76),
(266, 77),
(267, 78),
(268, 79),
(269, 80),
(270, 81),
(271, 82),
(272, 83),
(273, 84),
(274, 85),
(275, 86),
(276, 87),
(277, 88);

-- --------------------------------------------------------

--
-- ط¨ظ†ظٹط© ط§ظ„ط¬ط¯ظˆظ„ `suspects`
--

CREATE TABLE `suspects` (
  `id` int(11) NOT NULL,
  `full_name` varchar(230) NOT NULL,
  `phone` varchar(20) NOT NULL DEFAULT 'ط؛ظٹط± ظ…ط­ط¯ط¯',
  `address` text NOT NULL DEFAULT 'ط؛ظٹط± ظ…ط¹ط±ظˆظپ',
  `status` enum('Wanted','Arrested','Cleared','Suspected') NOT NULL DEFAULT 'Wanted',
  `age` int(11) NOT NULL DEFAULT 0,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `national_id` varchar(20) NOT NULL DEFAULT 'ظ„ط§ ظٹظˆط¬ط¯',
  `districts_id` int(11) NOT NULL,
  `neighborhoods_id` int(11) NOT NULL,
  `gender` varchar(10) NOT NULL DEFAULT 'ط؛ظٹط± ظ…ط­ط¯ط¯'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- ط¥ط±ط¬ط§ط¹ ط£ظˆ ط§ط³طھظٹط±ط§ط¯ ط¨ظٹط§ظ†ط§طھ ط§ظ„ط¬ط¯ظˆظ„ `suspects`
--

INSERT INTO `suspects` (`id`, `full_name`, `phone`, `address`, `status`, `age`, `created_at`, `national_id`, `districts_id`, `neighborhoods_id`, `gender`) VALUES
(31, 'ط§ط­ظ…ط¯ ظ‚ط§ط¦ط¯ ط¹ط¨ط¯ط§ظ„ظ„ظ‡ ط§ط­ظ…ط¯ ', '7784549282', 'ط¬ظˆط§ط± ط·ظٹط¨ط©', 'Wanted', 52, '2025-09-03 19:13:54', '828288283', 1, 8, 'male'),
(32, 'ط§ط³ط¹ط¯ ط­ظ…ظٹط¯ ط³ظٹظپ ط§ظ„ط³ط¹ط¯ط§ظˆظٹ', '7784549282', 'ط¬ظˆط§ط± ط¨ظ‚ط§ظ„ط© ظ‡ط´ط§ظ…', 'Wanted', 22, '2025-09-03 19:14:00', '72626283838383', 1, 8, 'male'),
(37, 'kjkjkjkjkjk', '776767676', 'jhjhjhjhjhjhjj', 'Arrested', 55, '2025-09-14 07:47:25', '4564645454', 2, 13, 'male'),
(38, 'ط³ط¹ظٹط¯ ظ‚ط§ط¦ط¯ ط¹ط¨ط¯ط§ظ„ظ„ظ‡ ط§ط­ظ…ط¯ ط¹ظ„ظٹ ط³ط¹ظٹط¯ ', '777222888', 'ظ†ظٹظ†ظ†ظٹظ†ظٹظ†ظٹ', 'Wanted', 77, '2025-09-20 23:33:48', '828282', 2, 12, 'male'),
(39, 'ط¹ظ„ظٹ ط¹ط¨ط¯ظ‡', '777282882', 'Hsjsj', 'Arrested', 45, '2025-09-29 23:26:42', '81818188128828', 1, 3, 'male'),
(40, 'ط¹ظ„ظٹ ط³ط¹ظٹط¯ ظ‚ط§ط¦ط¯ ط¹ط¨ط¯ظ‡', '778282882', 'ط·ظٹط¨ظ‡ ط§ظ„ظ‚ط§ظ‡ط±ظ‡', 'Arrested', 22, '2025-10-01 21:08:27', '8288282828', 3, 17, 'male'),
(41, 'ط³ط¹ظٹط¯ ظ‚ط§ط¦ط¯ ط¹ط¨ط¯ط§ظ„ظ„ظ‡ ط§ط­ظ…ط¯ ط¹ظ„ظٹ ط³ط¹ظٹط¯ ', '777333388', 'Vabba', 'Wanted', 52, '2025-10-03 15:41:57', '828282', 2, 14, 'male'),
(42, 'ط§ط­ظ…ط¯ ط­ظ…ظٹط¯ ط¹ظ„ظٹ طµط§ظ„ط­ ', '772728282', 'طھط­طھ ط§ظ„ط³ظپظ„', 'Arrested', 23, '2025-10-03 18:19:28', '827383833', 2, 15, 'male'),
(43, 'ط¹ط¨ط¯ ط³ط¹ظٹط¯ ط¹ظ„ظٹ ', '777000', 'ط¬ط¨ظ„ ط­ط¨ط´ظٹ', 'Wanted', 20, '2025-10-03 23:57:02', '8383883', 2, 14, 'male'),
(44, 'Jsjsjsjsjsjsjjs', '7727288282', 'ظ…ظٹظ…ظٹظ…ظٹظ…ظٹظ†ظٹ', 'Wanted', 34, '2025-10-05 20:14:46', '929928292', 1, 1, 'male'),
(48, 'Jsjjsjhsjshhhshs', '7277273', 'Jsjsjjs', 'Wanted', 56, '2025-10-05 20:54:41', '7272772', 6, 33, 'male'),
(49, 'Jsjjsjhsjshhhshs', '7277273', 'Jsjsjjs', 'Wanted', 56, '2025-10-05 20:57:39', '7272772', 6, 33, 'male'),
(50, 'ط¹ظ„ظٹ', '7277273', 'Jsjsjjs', 'Wanted', 56, '2025-10-05 20:58:52', '7272772', 6, 33, 'male'),
(51, 'ط³ط¹ظٹط¯ hhhhhhhhh', '7777777', 'ظ†ظٹظ†ظٹظ…ظٹظ…', 'Wanted', 22, '2025-10-06 21:33:02', '728282', 1, 1, 'male'),
(52, 'ط³ط¹ظٹط¯ hhhhhhhhh', '7777777', 'ظ†ظٹظ†ظٹظ…ظٹظ…', 'Wanted', 22, '2025-10-06 21:33:25', '728282', 1, 1, 'male'),
(53, 'ط³ط¹ظٹط¯ hhhhhhhhh', '7777777', 'ظ†ظٹظ†ظٹظ…ظٹظ…', 'Wanted', 22, '2025-10-06 21:34:28', '728282', 1, 1, 'male'),
(54, 'ط³ط¹ظٹط¯ hhhhhhhhh', '7777777', 'ظ†ظٹظ†ظٹظ…ظٹظ…', 'Wanted', 22, '2025-10-06 21:35:37', '728282', 1, 1, 'male'),
(55, 'ط³ط¹ظٹط¯ hhhhhhhhh', '7777777', 'ظ†ظٹظ†ظٹظ…ظٹظ…', 'Wanted', 22, '2025-10-06 21:36:51', '728282', 1, 1, 'male'),
(56, 'ط³ط¹ظٹط¯ hhhhhhhhh', '7777777', 'ظ†ظٹظ†ظٹظ…ظٹظ…', 'Wanted', 22, '2025-10-06 21:38:52', '728282', 1, 1, 'male'),
(57, 'ط³ط¹ظٹط¯ hhhhhhhhh', '7777777', 'ظ†ظٹظ†ظٹظ…ظٹظ…', 'Wanted', 22, '2025-10-06 21:38:58', '728282', 1, 1, 'male'),
(58, 'ط³ط¹ظٹط¯ hhhhhhhhh', '7777777', 'ظ†ظٹظ†ظٹظ…ظٹظ…', 'Wanted', 22, '2025-10-06 21:39:08', '728282', 1, 1, 'male'),
(59, 'ط³ط¹ظٹط¯ hhhhhhhhh', '7777777', 'ظ†ظٹظ†ظٹظ…ظٹظ…', 'Wanted', 22, '2025-10-06 21:39:13', '728282', 1, 1, 'male'),
(60, 'ط³ط¹ظٹط¯ hhhhhhhhh', '7777777', 'ظ†ظٹظ†ظٹظ…ظٹظ…', 'Wanted', 22, '2025-10-06 21:39:18', '728282', 1, 1, 'male'),
(61, 'ط³ط¹ظٹط¯ hhhhhhhhh', '7777777', 'ظ†ظٹظ†ظٹظ…ظٹظ…', 'Wanted', 22, '2025-10-06 21:39:31', '728282', 1, 1, 'male'),
(62, 'ط³ط¹ظٹط¯ hhhhhhhhh', '7777777', 'ظ†ظٹظ†ظٹظ…ظٹظ…', 'Wanted', 22, '2025-10-06 21:39:35', '728282', 1, 1, 'male'),
(63, 'ط³ط¹ظٹط¯ hhhhhhhhh', '7777777', 'ظ†ظٹظ†ظٹظ…ظٹظ…', 'Wanted', 22, '2025-10-06 21:40:19', '728282', 1, 1, 'male'),
(64, 'ط³ط¹ظٹط¯ hhhhhhhhh', '7777777', 'ظ†ظٹظ†ظٹظ…ظٹظ…', 'Wanted', 22, '2025-10-06 21:40:33', '728282', 1, 1, 'male'),
(65, 'ط³ط¹ظٹط¯ hhhhhhhhh', '7777777', 'ظ†ظٹظ†ظٹظ…ظٹظ…', 'Wanted', 22, '2025-10-06 21:41:22', '728282', 1, 1, 'male'),
(66, 'ط³ط¹ظٹط¯ hhhhhhhhh', '7777777', 'ظ†ظٹظ†ظٹظ…ظٹظ…', 'Wanted', 22, '2025-10-06 21:41:43', '728282', 1, 1, 'male'),
(67, 'ط³ط¹ظٹط¯ hhhhhhhhh', '7777777', 'ظ†ظٹظ†ظٹظ…ظٹظ…', 'Wanted', 22, '2025-10-06 21:42:12', '728282', 1, 1, 'male'),
(68, 'ط³ط¹ظٹط¯ hhhhhhhhh', '7777777', 'ظ†ظٹظ†ظٹظ…ظٹظ…', 'Wanted', 22, '2025-10-06 21:43:20', '728282', 1, 1, 'male'),
(78, 'ط¹ظ„ظٹ ظ†ظٹظ†ظٹظ†ظٹظ†ظٹظ†ظٹظ†ظٹظٹ', 'ط³ط¹ظٹط¯', 'ظ‚ط§ط¹ط±طھ ظٹظ†ظٹظ†ظٹظ†ظٹظ†ظٹ', 'Wanted', 20, '2025-10-06 22:22:59', '8282727', 1, 1, 'male'),
(88, 'ط¥ظٹظ‡ط§ط¨ ظپظٹطµظ„ ظ†ط¹ظ…ط§ظ† ', '777222681', 'ط§ظ„طھط­ظ‰ظٹط± ط§ظ„ط§ط³ظپظ„ ', 'Wanted', 22, '2025-10-07 00:30:17', '81818', 1, 1, 'male');

--
-- Indexes for dumped tables
--

--
-- ظپظ‡ط§ط±ط³ ظ„ظ„ط¬ط¯ظˆظ„ `alert_checkpoints`
--
ALTER TABLE `alert_checkpoints`
  ADD PRIMARY KEY (`id`),
  ADD KEY `alert_id` (`alert_id`),
  ADD KEY `checkpoint_id` (`checkpoint_id`);

--
-- ظپظ‡ط§ط±ط³ ظ„ظ„ط¬ط¯ظˆظ„ `checkpoints`
--
ALTER TABLE `checkpoints`
  ADD PRIMARY KEY (`id`);

--
-- ظپظ‡ط§ط±ط³ ظ„ظ„ط¬ط¯ظˆظ„ `department`
--
ALTER TABLE `department`
  ADD PRIMARY KEY (`id`),
  ADD KEY `districts_id` (`districts_id`),
  ADD KEY `neighborhoods_id` (`neighborhoods_id`);

--
-- ظپظ‡ط§ط±ط³ ظ„ظ„ط¬ط¯ظˆظ„ `department_report_reviews`
--
ALTER TABLE `department_report_reviews`
  ADD PRIMARY KEY (`id`),
  ADD KEY `report_id` (`report_id`),
  ADD KEY `department_id` (`department_id`),
  ADD KEY `reviewer_id` (`reviewer_id`);

--
-- ظپظ‡ط§ط±ط³ ظ„ظ„ط¬ط¯ظˆظ„ `districts`
--
ALTER TABLE `districts`
  ADD PRIMARY KEY (`id`),
  ADD KEY `governorate_id` (`governorate_id`);

--
-- ظپظ‡ط§ط±ط³ ظ„ظ„ط¬ط¯ظˆظ„ `employees`
--
ALTER TABLE `employees`
  ADD PRIMARY KEY (`employee_id`),
  ADD KEY `department_id` (`department_id`);

--
-- ظپظ‡ط§ط±ط³ ظ„ظ„ط¬ط¯ظˆظ„ `error_reports`
--
ALTER TABLE `error_reports`
  ADD PRIMARY KEY (`id`),
  ADD KEY `department_id` (`department_id`),
  ADD KEY `report_id` (`report_id`);

--
-- ظپظ‡ط§ط±ط³ ظ„ظ„ط¬ط¯ظˆظ„ `governorates`
--
ALTER TABLE `governorates`
  ADD PRIMARY KEY (`id`);

--
-- ظپظ‡ط§ط±ط³ ظ„ظ„ط¬ط¯ظˆظ„ `logs_activity`
--
ALTER TABLE `logs_activity`
  ADD PRIMARY KEY (`id_activity`),
  ADD KEY `id_user` (`id_user`);

--
-- ظپظ‡ط§ط±ط³ ظ„ظ„ط¬ط¯ظˆظ„ `neighborhoods`
--
ALTER TABLE `neighborhoods`
  ADD PRIMARY KEY (`id`),
  ADD KEY `district_id` (`district_id`);

--
-- ظپظ‡ط§ط±ط³ ظ„ظ„ط¬ط¯ظˆظ„ `police_alerts`
--
ALTER TABLE `police_alerts`
  ADD PRIMARY KEY (`alert_id`),
  ADD KEY `department_id` (`department_id`),
  ADD KEY `suspects_id` (`suspects_id`);

--
-- ظپظ‡ط§ط±ط³ ظ„ظ„ط¬ط¯ظˆظ„ `reporters`
--
ALTER TABLE `reporters`
  ADD PRIMARY KEY (`id`),
  ADD KEY `districts_id` (`districts_id`),
  ADD KEY `neighborhoods_id` (`neighborhoods_id`);

--
-- ظپظ‡ط§ط±ط³ ظ„ظ„ط¬ط¯ظˆظ„ `reports`
--
ALTER TABLE `reports`
  ADD PRIMARY KEY (`report_id`),
  ADD UNIQUE KEY `report_number` (`report_number`),
  ADD UNIQUE KEY `unique_report_number` (`report_number`),
  ADD KEY `main_id` (`main_id`),
  ADD KEY `sub_id` (`sub_id`),
  ADD KEY `districts_id` (`districts_id`),
  ADD KEY `neighborhoods_id` (`neighborhoods_id`);

--
-- ظپظ‡ط§ط±ط³ ظ„ظ„ط¬ط¯ظˆظ„ `report_department`
--
ALTER TABLE `report_department`
  ADD PRIMARY KEY (`report_id`,`department_id`),
  ADD KEY `department_id` (`department_id`);

--
-- ظپظ‡ط§ط±ط³ ظ„ظ„ط¬ط¯ظˆظ„ `report_main_types`
--
ALTER TABLE `report_main_types`
  ADD PRIMARY KEY (`id`);

--
-- ظپظ‡ط§ط±ط³ ظ„ظ„ط¬ط¯ظˆظ„ `report_reporter`
--
ALTER TABLE `report_reporter`
  ADD KEY `reporter_id` (`reporter_id`),
  ADD KEY `report_id` (`report_id`);

--
-- ظپظ‡ط§ط±ط³ ظ„ظ„ط¬ط¯ظˆظ„ `report_sub_types`
--
ALTER TABLE `report_sub_types`
  ADD PRIMARY KEY (`id`),
  ADD KEY `main_type_id` (`main_type_id`);

--
-- ظپظ‡ط§ط±ط³ ظ„ظ„ط¬ط¯ظˆظ„ `report_suspect`
--
ALTER TABLE `report_suspect`
  ADD KEY `report_id` (`report_id`),
  ADD KEY `suspect_id` (`suspect_id`);

--
-- ظپظ‡ط§ط±ط³ ظ„ظ„ط¬ط¯ظˆظ„ `suspects`
--
ALTER TABLE `suspects`
  ADD PRIMARY KEY (`id`),
  ADD KEY `districts_id` (`districts_id`),
  ADD KEY `neighborhoods_id` (`neighborhoods_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `alert_checkpoints`
--
ALTER TABLE `alert_checkpoints`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `checkpoints`
--
ALTER TABLE `checkpoints`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `department`
--
ALTER TABLE `department`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `department_report_reviews`
--
ALTER TABLE `department_report_reviews`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=129;

--
-- AUTO_INCREMENT for table `districts`
--
ALTER TABLE `districts`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;

--
-- AUTO_INCREMENT for table `employees`
--
ALTER TABLE `employees`
  MODIFY `employee_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=23;

--
-- AUTO_INCREMENT for table `error_reports`
--
ALTER TABLE `error_reports`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `governorates`
--
ALTER TABLE `governorates`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `logs_activity`
--
ALTER TABLE `logs_activity`
  MODIFY `id_activity` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=60;

--
-- AUTO_INCREMENT for table `neighborhoods`
--
ALTER TABLE `neighborhoods`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=72;

--
-- AUTO_INCREMENT for table `police_alerts`
--
ALTER TABLE `police_alerts`
  MODIFY `alert_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `reporters`
--
ALTER TABLE `reporters`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=128;

--
-- AUTO_INCREMENT for table `reports`
--
ALTER TABLE `reports`
  MODIFY `report_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=278;

--
-- AUTO_INCREMENT for table `report_main_types`
--
ALTER TABLE `report_main_types`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT for table `report_sub_types`
--
ALTER TABLE `report_sub_types`
  MODIFY `id` int(6) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=47;

--
-- AUTO_INCREMENT for table `suspects`
--
ALTER TABLE `suspects`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=89;

--
-- ط§ظ„ظ‚ظٹظˆط¯ ط§ظ„ظ…ظپط±ظˆط¶ط© ط¹ظ„ظ‰ ط§ظ„ط¬ط¯ط§ظˆظ„ ط§ظ„ظ…ظ„ظ‚ط§ط©
--

--
-- ظ‚ظٹظˆط¯ ط§ظ„ط¬ط¯ط§ظˆظ„ `alert_checkpoints`
--
ALTER TABLE `alert_checkpoints`
  ADD CONSTRAINT `alert_checkpoints_ibfk_1` FOREIGN KEY (`alert_id`) REFERENCES `police_alerts` (`alert_id`),
  ADD CONSTRAINT `alert_checkpoints_ibfk_2` FOREIGN KEY (`checkpoint_id`) REFERENCES `checkpoints` (`id`);

--
-- ظ‚ظٹظˆط¯ ط§ظ„ط¬ط¯ط§ظˆظ„ `department`
--
ALTER TABLE `department`
  ADD CONSTRAINT `department_ibfk_1` FOREIGN KEY (`districts_id`) REFERENCES `districts` (`id`),
  ADD CONSTRAINT `department_ibfk_2` FOREIGN KEY (`neighborhoods_id`) REFERENCES `neighborhoods` (`id`);

--
-- ظ‚ظٹظˆط¯ ط§ظ„ط¬ط¯ط§ظˆظ„ `department_report_reviews`
--
ALTER TABLE `department_report_reviews`
  ADD CONSTRAINT `department_report_reviews_ibfk_1` FOREIGN KEY (`report_id`) REFERENCES `reports` (`report_id`),
  ADD CONSTRAINT `department_report_reviews_ibfk_2` FOREIGN KEY (`department_id`) REFERENCES `department` (`id`),
  ADD CONSTRAINT `department_report_reviews_ibfk_3` FOREIGN KEY (`reviewer_id`) REFERENCES `employees` (`employee_id`);

--
-- ظ‚ظٹظˆط¯ ط§ظ„ط¬ط¯ط§ظˆظ„ `districts`
--
ALTER TABLE `districts`
  ADD CONSTRAINT `districts_ibfk_1` FOREIGN KEY (`governorate_id`) REFERENCES `governorates` (`id`) ON DELETE CASCADE;

--
-- ظ‚ظٹظˆط¯ ط§ظ„ط¬ط¯ط§ظˆظ„ `employees`
--
ALTER TABLE `employees`
  ADD CONSTRAINT `employees_ibfk_1` FOREIGN KEY (`department_id`) REFERENCES `department` (`id`);

--
-- ظ‚ظٹظˆط¯ ط§ظ„ط¬ط¯ط§ظˆظ„ `error_reports`
--
ALTER TABLE `error_reports`
  ADD CONSTRAINT `error_reports_ibfk_1` FOREIGN KEY (`department_id`) REFERENCES `department` (`id`),
  ADD CONSTRAINT `error_reports_ibfk_2` FOREIGN KEY (`report_id`) REFERENCES `reports` (`report_id`);

--
-- ظ‚ظٹظˆط¯ ط§ظ„ط¬ط¯ط§ظˆظ„ `logs_activity`
--
ALTER TABLE `logs_activity`
  ADD CONSTRAINT `logs_activity_ibfk_1` FOREIGN KEY (`id_user`) REFERENCES `employees` (`employee_id`);

--
-- ظ‚ظٹظˆط¯ ط§ظ„ط¬ط¯ط§ظˆظ„ `neighborhoods`
--
ALTER TABLE `neighborhoods`
  ADD CONSTRAINT `neighborhoods_ibfk_1` FOREIGN KEY (`district_id`) REFERENCES `districts` (`id`);

--
-- ظ‚ظٹظˆط¯ ط§ظ„ط¬ط¯ط§ظˆظ„ `police_alerts`
--
ALTER TABLE `police_alerts`
  ADD CONSTRAINT `police_alerts_ibfk_1` FOREIGN KEY (`department_id`) REFERENCES `department` (`id`),
  ADD CONSTRAINT `police_alerts_ibfk_2` FOREIGN KEY (`suspects_id`) REFERENCES `suspects` (`id`);

--
-- ظ‚ظٹظˆط¯ ط§ظ„ط¬ط¯ط§ظˆظ„ `reporters`
--
ALTER TABLE `reporters`
  ADD CONSTRAINT `reporters_ibfk_1` FOREIGN KEY (`districts_id`) REFERENCES `districts` (`id`),
  ADD CONSTRAINT `reporters_ibfk_2` FOREIGN KEY (`neighborhoods_id`) REFERENCES `neighborhoods` (`id`);

--
-- ظ‚ظٹظˆط¯ ط§ظ„ط¬ط¯ط§ظˆظ„ `reports`
--
ALTER TABLE `reports`
  ADD CONSTRAINT `reports_ibfk_1` FOREIGN KEY (`main_id`) REFERENCES `report_main_types` (`id`),
  ADD CONSTRAINT `reports_ibfk_2` FOREIGN KEY (`sub_id`) REFERENCES `report_sub_types` (`id`),
  ADD CONSTRAINT `reports_ibfk_3` FOREIGN KEY (`districts_id`) REFERENCES `districts` (`id`),
  ADD CONSTRAINT `reports_ibfk_4` FOREIGN KEY (`neighborhoods_id`) REFERENCES `neighborhoods` (`id`);

--
-- ظ‚ظٹظˆط¯ ط§ظ„ط¬ط¯ط§ظˆظ„ `report_department`
--
ALTER TABLE `report_department`
  ADD CONSTRAINT `report_department_ibfk_1` FOREIGN KEY (`report_id`) REFERENCES `reports` (`report_id`),
  ADD CONSTRAINT `report_department_ibfk_2` FOREIGN KEY (`department_id`) REFERENCES `department` (`id`);

--
-- ظ‚ظٹظˆط¯ ط§ظ„ط¬ط¯ط§ظˆظ„ `report_reporter`
--
ALTER TABLE `report_reporter`
  ADD CONSTRAINT `report_reporter_ibfk_1` FOREIGN KEY (`reporter_id`) REFERENCES `reporters` (`id`),
  ADD CONSTRAINT `report_reporter_ibfk_2` FOREIGN KEY (`report_id`) REFERENCES `reports` (`report_id`);

--
-- ظ‚ظٹظˆط¯ ط§ظ„ط¬ط¯ط§ظˆظ„ `report_sub_types`
--
ALTER TABLE `report_sub_types`
  ADD CONSTRAINT `report_sub_types_ibfk_1` FOREIGN KEY (`main_type_id`) REFERENCES `report_main_types` (`id`);

--
-- ظ‚ظٹظˆط¯ ط§ظ„ط¬ط¯ط§ظˆظ„ `report_suspect`
--
ALTER TABLE `report_suspect`
  ADD CONSTRAINT `report_suspect_ibfk_1` FOREIGN KEY (`report_id`) REFERENCES `reports` (`report_id`),
  ADD CONSTRAINT `report_suspect_ibfk_2` FOREIGN KEY (`suspect_id`) REFERENCES `suspects` (`id`);

--
-- ظ‚ظٹظˆط¯ ط§ظ„ط¬ط¯ط§ظˆظ„ `suspects`
--
ALTER TABLE `suspects`
  ADD CONSTRAINT `suspects_ibfk_1` FOREIGN KEY (`districts_id`) REFERENCES `districts` (`id`),
  ADD CONSTRAINT `suspects_ibfk_2` FOREIGN KEY (`neighborhoods_id`) REFERENCES `neighborhoods` (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;

